[{"ranking": 0, "story_id": "10003121", "time": "2015-08-04T21:12:13", "id": "10003141", "query_class": null, "text": "I really like this change! More room for the video, and it actually looks pretty good too.", "query": null, "by": "azeirah"}, {"ranking": 0, "story_id": "10006740", "time": "2015-08-05T06:42:00", "id": "10006754", "query_class": null, "text": "Can you elaborate? The Perfumed Court is a great place to find decants of fragrances that you may or may not want to buy a full bottle of.", "query": null, "by": "joe5150"}, {"ranking": 0, "story_id": "1000828", "time": "2009-12-17T21:45:18", "id": "1000983", "query_class": null, "text": "There seem to me to be too many places to go from the home page. Don't Features, FAQ, About, Tour, and Guides all just really mean \"Tell me more?\" My first thought when landing was, \"What does a typical coupon look like,\" but I had (and still have) no idea what I would click to find that out.
Also, the blog is a dead end. Once you get there, your back button is the only way to get out (the logo doesn't even link back to the home page, which is never ok). The back button is not navigation.

There seem to be too many pricing options, and they are confusing (not to mention the confusion of \"pricing\" and \"free account\" being right next to each other on the home page). What could one possibly do with 1 coupon for all time and emailing it only 3 times a month? Do you pay for the emails you send in \"included emails?\" Why mention a setup fee at all if you don't have one? Instead of repeating things which are in all accounts, put them in an \"all accounts come with\" section so the user can actually see what the difference between the accounts is (same goes for the feature comparison).

Actually, I think something like this would make more sense to be priced by actual usage.

The FAQ page does not give any visual cue that the questions are items in a list. It looks like a single paragraph.

And wait... someone from Pixar gave you a testimonial and it's hidden with poor contrast at the bottom of the page?

Don't get me wrong. The site looks great. It just simultaneously has too much information and too little (because it's too hard to find anything).", "query": null, "by": "DanielStraight"}, {"ranking": 0, "story_id": "10022111", "time": "2015-08-07T20:49:09", "id": "10022119", "query_class": null, "text": "I wrote a program that allows you to display shadertoy shaders (and other html5 canvas things) on your corsair K70 rgb keyboard.

The github project has instructions, but I've made some additional notes, these can be found on reddit: https://www.reddit.com/r/MechanicalKeyboards/comments/3g4bs6...", "query": null, "by": "azeirah"}, {"ranking": 0, "story_id": "10025840", "time": "2015-08-08T09:44:59", "id": "10026008", "query_class": null, "text": "Blogspam. Original: http://stephaniesinclair.photoshelter.com/gallery/TYTW-Tifs/...", "query": null, "by": "gus_massa"}, {"ranking": 0, "story_id": "10054658", "time": "2015-08-13T22:59:08", "id": "10054673", "query_class": null, "text": "Website responding but hangs. Probably a database lock.", "query": null, "by": "PythonDeveloper"}, {"ranking": 0, "story_id": "10058371", "time": "2015-08-14T14:03:51", "id": "10058845", "query_class": null, "text": "discussion: https://news.ycombinator.com/item?id=9842295", "query": null, "by": "jcr"}, {"ranking": 0, "story_id": "10101348", "time": "2015-08-22T11:19:20", "id": "10101386", "query_class": null, "text": "Blogspam. Original: https://threatpost.com/wordpress-compromises-behind-spike-in...", "query": null, "by": "gus_massa"}, {"ranking": 1, "story_id": "10123751", "time": "2015-08-27T00:15:00", "id": "10123948", "query_class": null, "text": "original: http://webpolicy.org/2015/08/25/att-hotspots-now-with-advert...", "query": null, "by": "pki"}, {"ranking": 0, "story_id": "10123751", "time": "2015-08-27T00:16:05", "id": "10123963", "query_class": null, "text": "Was discussed yesterday[0] with the original blog post.

[0] https://news.ycombinator.com/item?id=10119348", "query": null, "by": "kyrra"}, {"ranking": 0, "story_id": "10147430", "time": "2015-09-01T13:52:08", "id": "10150933", "query_class": null, "text": "Previously: https://news.ycombinator.com/item?id=10147318", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "10179884", "time": "2015-09-07T11:14:44", "id": "10179906", "query_class": null, "text": "don't miss the next video in the same youtube channel where they compare an apple to an orange. exciting stuff!", "query": null, "by": "lingben"}, {"ranking": 16, "story_id": "10203205", "time": "2015-09-11T20:30:35", "id": "10203251", "query_class": null, "text": "Nigger. Obama the nigger is atheist. The Pope he put in is atheist nigger.", "query": null, "by": "TerryADavis"}, {"ranking": 2, "story_id": "10203205", "time": "2015-09-11T20:30:35", "id": "10203252", "query_class": null, "text": "No, they shouldn't. The article says that through god you can justify anything. It appears in the absence of God you can do the same things. No one appears to have the duality of man or even basic separation of things that you beleve versus things you know?", "query": null, "by": "zitterbewegung"}, {"ranking": 17, "story_id": "10203205", "time": "2015-09-11T20:32:57", "id": "10203259", "query_class": null, "text": "Go listen to what a real scientist like Neil Degrasse Tyson has to say on the subject. To be atheist is to give into a belief without proof, only absent of proof of the opposite. The scientific mind is one that questions and looks for evidence of answers to those questions, not to "militantly" defend an assumption.", "query": null, "by": "mizchief2"}, {"ranking": 19, "story_id": "10203205", "time": "2015-09-11T20:35:12", "id": "10203271", "query_class": null, "text": "Real scientists recognize Atheism as being illogical as both it and Theism are based on faith.

The Agnostic position is the only logical position one can take, as it is not faith-based and it makes an assertion that is true: we don't really know if a God(s) exist or do not exist. There's no proof that one does, and there will never be proof that none do.", "query": null, "by": "easter6"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:36:08", "id": "10203276", "query_class": null, "text": "Real scientists know the colloquial notion of atheism is false and are, in fact, atheists.", "query": null, "by": "verbin217"}, {"ranking": 4, "story_id": "10203205", "time": "2015-09-11T20:36:22", "id": "10203277", "query_class": null, "text": "On an aside: I just noticed the nice underlining used in the site. After some digging, I came across these two links [1,2] explaining how it works. Very interesting:

[1] http://www.acusti.ca/blog/2014/11/28/towards-a-more-perfect-...

[2] https://medium.com/designing-medium/crafting-link-underlines...", "query": null, "by": "gone35"}, {"ranking": 1, "story_id": "10203205", "time": "2015-09-11T20:36:37", "id": "10203279", "query_class": null, "text": "> The article says that through god you can justify anything. It appears in the absence of God you can do the same things.

Would you like to substantiate this claim? How is it possible for an atheist with a philosophy rooted in the scientific method justify "anything" without contradicting core principles of said scientific method?

EDIT: For some reason I am unable to reply anywhere in this thread, so I am updating this. Current replies are missing an important point: adherence to scientific method and atheism requires adopting a set of constraints logically derived from axioms of the scientific method. This constraints are concrete, empirical, testable. They greatly decrease the cardinality of a set with non-contradictory justifiable ideas.

On a side note, it is amusing to see HN blossom with postmodern philosophy when religion is involved.", "query": null, "by": "vdaniuk"}, {"ranking": 18, "story_id": "10203205", "time": "2015-09-11T20:38:43", "id": "10203287", "query_class": null, "text": ">ITA(rticle) fedora tippers", "query": null, "by": "devilmoon"}, {"ranking": 11, "story_id": "10203205", "time": "2015-09-11T20:39:01", "id": "10203291", "query_class": null, "text": "Nope, they should be militant sceptics.", "query": null, "by": "lugus35"}, {"ranking": 2, "story_id": "10203205", "time": "2015-09-11T20:39:08", "id": "10203293", "query_class": null, "text": "Yes, with the absence of god Stalin for example justified a whole lot of things. So did Mao.

One shouldn't underestimate the effect of an authority (possibly imagined - I don't want to argue about this here) that might judge you no matter if no one will be able to judge you here in life.

There are many people that would refrain from certain acts just because of this belief.", "query": null, "by": "DominikR"}, {"ranking": 13, "story_id": "10203205", "time": "2015-09-11T20:39:58", "id": "10203296", "query_class": null, "text": "I am tired of "atheist" scientists, how can you justify scientifically the absence of god?

When you enter the non-falsable territory you can believe what you want, and in parallel do all the science you want.

I agree with the author that you cant break the law because of religious ideas, but also in geneal you dont want to force someone to do something that hoes against his beleifs.", "query": null, "by": "singold"}, {"ranking": 8, "story_id": "10203205", "time": "2015-09-11T20:41:27", "id": "10203304", "query_class": null, "text": "I am pragmatic

I don't care in what scientists believe as long as they do their job (that are accepted in the society) and their beliefs don't interfere with it.

Also remember there are racists, conspiracy nuts, religious zealots within the scientific community as well (and let me say especially since "being a researcher" is more about pushing conservative papers and doing bureaucracy than actually experimenting stuff)", "query": null, "by": "raverbashing"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:41:28", "id": "10203305", "query_class": null, "text": "I should preface this by saying that I'm an atheist scientist myself, but...

The author has no idea what he's talking about. He's clearly ignorant of basic epistemology as it relates to both religion and his own field. Worse, he embodies the kind of hubris for which the militant atheist community has gained notoriety.

There are sacred ideas in science. Granted, they aren't referred to as sacred per se, but they are the same thing at their core: non-negotiable tenets that are accepted a priori. In science, we typically call such things "assumptions" or "postulates".

To list but one example, take the idea that truth is ascertainable through the senses (empiricism). This is a metaphysical question which the natural sciences, by their own admission, cannot scrutinize.

Edit: why on earth was the article flagged? Just when the debate was getting interesting!", "query": null, "by": "omginternets"}, {"ranking": 12, "story_id": "10203205", "time": "2015-09-11T20:41:50", "id": "10203308", "query_class": null, "text": "The premise of science held by scientists is to do everything from the power of understanding to refute the existence of higher or supernatural force or being that cannot be quantified in that very power of understanding.

So in short, scientists are the military wing of atheism, for they fight the battles that might terrorize atheists into thinking that a higher supernatural order exists.", "query": null, "by": "nashashmi"}, {"ranking": 14, "story_id": "10203205", "time": "2015-09-11T20:42:18", "id": "10203311", "query_class": null, "text": "This is just brought up around the author sitting in airports and having to deal with CNN's news cycle... Of course there's strong reactions from both sides but the court case is playing out in your position's favor.

Ignore and it will fade.", "query": null, "by": "icklepthe"}, {"ranking": 9, "story_id": "10203205", "time": "2015-09-11T20:42:25", "id": "10203312", "query_class": null, "text": "Apart from the clickbait title, the article is mostly common sense. No ideas should be held as beyond questioning/testing/proving etc. Labeling this approach as atheism just confuses the matter.", "query": null, "by": "mcphilip"}, {"ranking": 2, "story_id": "10203205", "time": "2015-09-11T20:42:34", "id": "10203315", "query_class": null, "text": "The Brother's Karamazov. If there is no god, than perhaps there are no consequences to our actions.

Anyways. I'm with Einstein, the universe is way too elegant for there not to be a god.", "query": null, "by": "blazespin"}, {"ranking": 10, "story_id": "10203205", "time": "2015-09-11T20:44:02", "id": "10203320", "query_class": null, "text": "Scientists should advocate science.

God & friends are beside the point, though. Religion in public life is more often a sock puppet, obediently speaking the lines of basically non religious ideas like Catholic natural law philosophy and evangelical panic in the face of modernity.

In this regard, atheism and theism are just playing the roles of competing sock puppets and you won't alter the debate by banishing God from it. It will likely just jump to another equally obliging puppet (such as arguing on the basis of what's "natural").", "query": null, "by": "JulianMorrison"}, {"ranking": 3, "story_id": "10203205", "time": "2015-09-11T20:44:13", "id": "10203322", "query_class": null, "text": "He could take a nihilist, hedonistic position. It doesn't matter if he hurts someone through his acts if there is no one to judge him.

Of course atheists are not devoid of morals and certainly not all religious people are acting in a moral way.", "query": null, "by": "DominikR"}, {"ranking": 5, "story_id": "10203205", "time": "2015-09-11T20:44:32", "id": "10203323", "query_class": null, "text": "Science and religion conflict because they're both seen as a source of truth.

However, if we were mature about it we'd see that neither science or religion is a source of truth, not of absolute truth anyway. The important part of science is the method of inquiry, the important part of religion is the method of building character.

If both scientists and religious leaders could accept the 'all I know is that I know nothing' idea, I suspect there'd be much fewer issues between them.", "query": null, "by": "ZenoArrow"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:44:37", "id": "10203324", "query_class": null, "text": "Because the scientific method has nothing to do with morality. The author gives the example in his own article when he says that he doesn't understand why people would have a problem experimenting on aborted or miscarried foetuses.

Well the scientist might see it as a bag of matter that would otherwise be thrown out with the trash, but unborn child's mother might have a different perspective on the issue. It concerns me that the author apparently doesn't get this.", "query": null, "by": "marrs"}, {"ranking": 6, "story_id": "10203205", "time": "2015-09-11T20:45:18", "id": "10203327", "query_class": null, "text": "This one contains fantastic snippets.

"Belief or nonbelief in God is irrelevant to our understanding of the workings of naturexe2x80x94just as itxe2x80x99s irrelevant to the question of whether or not citizens are obligated to follow the law."

"Five hundred years of science have liberated humanity from the shackles of enforced ignorance. We should celebrate this openly and enthusiastically, regardless of whom it may offend."", "query": null, "by": "fsloth"}, {"ranking": 1, "story_id": "10203205", "time": "2015-09-11T20:46:38", "id": "10203332", "query_class": null, "text": "Real scientists with half an ounce of amateur-level psychology and social-sciences under their belt ought to be capable of realizing that scientists writ large are capable of: having a variety of different personal goals (including desired sociopolitical outcomes), thinking intelligently about whether or not "militantism" in their belief system is the most effective way to achieve their goals all the time (or if they'd attract more flies with honey than vinegar), the extent to which it's ethical to inflict their beliefs and goals on an unwilling populace (whether that be university students or the people of the world), whether irrational behaviors are sometimes perhaps super-rational, and the role that this "religion" concept has played in human evolution and society.+

They're allowed a choice of answers, of course, so saying "all scientists should be militant atheists" is painting with a brush too broad.

They should also (generally speaking) welcome people from a diversity of cultures and ways of thinking, as these people can provide different perspectives on the questions in their field.

+ good book, btw: http://www.amazon.com/Religion-Human-Evolution-Paleolithic-A...", "query": null, "by": "fennecfoxen"}, {"ranking": 1, "story_id": "10203205", "time": "2015-09-11T20:47:00", "id": "10203333", "query_class": null, "text": "Science doesn't care about 'truth', but about falsifiable explanations and predictions. This is a complete opposite of religion.

Science admits there is a lot of things we don't understand, yet religion asserts a universal explanation of everything, God.", "query": null, "by": "gadrfgaesgysd"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:47:01", "id": "10203334", "query_class": null, "text": "That's missing the point, I think. Dr. Krauss wouldn't avoid challenging non-religious beliefs and theories that he believes are wrong, either. For example, he's vocal on climate change, and while there's some overlap between religiosity and disbelief in climate change (or disbelief that it matters even if it is occurring), the core claims of climate change vs no climate change are about sources of data and validity of models, which are secular arguments.

Pointing out that the sociological pathologies that lead to bad beliefs under religion can also exist in an ostensibly religion-free culture or group does not address the disparity in social acceptance of critique between bogus religious doctrine and bogus non-religious doctrine.

Krauss's argument is not that we should try to eradicate anything that encourages wrong belief (Krauss is not as extreme as Harris or Dawkins). Rather, Krauss's argument is that religious beliefs should be as open to criticism as non-religious belief (and not defended simply because they're religious in origin).", "query": null, "by": "harshreality"}, {"ranking": 1, "story_id": "10203205", "time": "2015-09-11T20:47:49", "id": "10203339", "query_class": null, "text": "The scientific method is not strictly sound from a logical perspective - it depends on the acceptance of an unproven prior axiom, namely that the universe works through repeatable rules and all knowledge about it can be acquired by performing controlled experiments. That axiom is not falsable, and therefore does not follow the scientific method; but as long as the results of this process are consistent - i.e. devoid from contradictions, we accept it for pragmatic reasons.

Scientific religious people work from a slightly different set of axioms: there is God which defines how the universe behaves, and knowledge is acquired by a combination of empiric observation and introspection about \nyour own and others' feelings. As long as the results of this process are also consistent, there is no logical difference between both philosophical approaches - either both are rational, or neither are.

I would love that more atheists understood the philosophical problem of the Regress argument [1] - it would make science-religion debates much more friendly and respectful.

[1] https://en.wikipedia.org/wiki/Regress_argument", "query": null, "by": "TuringTest"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:48:56", "id": "10203345", "query_class": null, "text": "I don't think that an attempt to bluff sociopaths is sufficient benefit for a generalized belief in a specific revengeful or judgemental higher being.", "query": null, "by": "fsloth"}, {"ranking": 3, "story_id": "10203205", "time": "2015-09-11T20:50:20", "id": "10203352", "query_class": null, "text": "As someone who do not believe in some higher powers and live without god, I can not disagree more with this view.

Not only is it simplistic to say the least it's also completely missing the point of science.

But even worse is that it's promoting a kind of atheism that is primarily of interest to a minute group of atheist who have been replacing religion with obsession.

Scientists can be doomsday religions fanatics for all I care. As long as they are curious, methodic, critical and factual; they are going to produce just as good work as someone who believes that scientists should be militant atheist.", "query": null, "by": "ThomPete"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:50:23", "id": "10203353", "query_class": null, "text": "Science and religion conflict because they're both seen as a source of truth.

Religion claims to be the source of [absolute] truth.

Science seems to be most humble about it, always self-doubting, always open to better explanations.

If both scientists and religious leaders could accept the 'all I know is that I know nothing' idea, I suspect there'd be much fewer issues between them.

Religion is much more than [absolute] truth.

It also claims [absolute] morality.

Absolute rules.

And that means their leaders, their belief and their rules are untouchable and will always be.", "query": null, "by": "emilsedgh"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:51:10", "id": "10203356", "query_class": null, "text": "The "all scientists should be militant atheists" part was more like "if liking good explanations over superstitious tradition is called militant atheism then yes, call me a militant atheist".", "query": null, "by": "fsloth"}, {"ranking": 1, "story_id": "10203205", "time": "2015-09-11T20:51:21", "id": "10203357", "query_class": null, "text": "I don't believe there is sufficient evidence for the existence of a super-natural, omnipotent being.

Further, I believe that the Gods described by every major religion were invented by humans.

As for strictly believing there is no god, it would require super-natural evidence to prove the non-existence of a super-natural being. Therefore, it's a nonsense question.

On the whole, this classifies me as an atheist. It requires no faith to believe that a mystic book, and a bunch of people who believe in it, are self-deluded. It is the extraordinary claim that requires extraordinary proof. Asserting the extraordinary claim is most likely not true is not a matter of faith, it should be the default position - especially after the overwhelming lack of evidence.", "query": null, "by": "VikingCoder"}, {"ranking": 2, "story_id": "10203205", "time": "2015-09-11T20:51:57", "id": "10203361", "query_class": null, "text": "I don't think either science or religion are seen as a source of the truth. They're both methods established to help seek the truth, be it rational truth in the case of science, or irrational truth in the case of religion, but neither purport to provide absolute answers.

I suppose between the times of Newton and Einstein you could say that science did purport to be able to provide all the answers, but I'm not sure that can still be claimed after Heisenberg.", "query": null, "by": "marrs"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:52:13", "id": "10203363", "query_class": null, "text": "The first snippet is quite absurd. Historically, laws are based on religious believes, or at least sacred texts.

The inherent difficulty of our modern society is to find new basis for grounding our laws on. But science is irrelevant in that matter. Which is why we see a resurgence of religious believes nowadays.", "query": null, "by": "bsaul"}, {"ranking": 7, "story_id": "10203205", "time": "2015-09-11T20:52:31", "id": "10203364", "query_class": null, "text": "Disappointing that bullshit clickbait articles get so much traction on HN.

> The Kim Davis story raises a basic question:

No, it really doesn't. A person's right to freedom of religion means they cannot be compelled to perform actions incompatible with that religion. Kim Davis is not compelled to marry gay people. Kim Davis chooses a job that has the requirement to marry gay people. Kim Davis is free to chose a job that fits her religion better. Sucks for her that the requirements of the job changed halfway through her career, but I guess I can't muster too much sympathy for ignorant fucking bigots who've forced their hate onto other people.", "query": null, "by": "DanBC"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:54:11", "id": "10203374", "query_class": null, "text": "A skeptic, presented with a super-natural explanation for natural events, which makes tons of falsifiable (and falsified!) claims, stops being skeptical, and asserts the theory is false.", "query": null, "by": "VikingCoder"}, {"ranking": 15, "story_id": "10203205", "time": "2015-09-11T20:54:35", "id": "10203378", "query_class": null, "text": "My take away isn't that scientists should be atheists, but people shouldn't be illogical bigots", "query": null, "by": "werber"}, {"ranking": 0, "story_id": "10203205", "time": "2015-09-11T20:55:00", "id": "10203381", "query_class": null, "text": "Good, in that case we're half way there, just need to have more guidance towards 'belief over truth' on the religious side.", "query": null, "by": "ZenoArrow"}, {"ranking": 0, "story_id": "10303131", "time": "2015-10-01T06:36:45", "id": "10307919", "query_class": null, "text": "https://news.ycombinator.com/item?id=8893738", "query": null, "by": "dang"}, {"ranking": 0, "story_id": "10363742", "time": "2015-10-10T07:16:51", "id": "10363789", "query_class": null, "text": "Previously: https://news.ycombinator.com/item?id=10363340", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "10364015", "time": "2015-10-10T10:33:42", "id": "10364236", "query_class": null, "text": "Previously: https://news.ycombinator.com/item?id=10363340", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "1128526", "time": "2010-02-16T16:08:14", "id": "1128560", "query_class": null, "text": "10 bucks says that its mashable doing it themself to get followers. A official google ad would want to get new users introduced to buzz, not follow mashable.", "query": null, "by": "DanBlake"}, {"ranking": 0, "story_id": "1137089", "time": "2010-02-20T00:21:00", "id": "1137243", "query_class": null, "text": "Re-post: http://news.ycombinator.com/item?id=1136998", "query": null, "by": "fadmmatt"}, {"ranking": 0, "story_id": "1141904", "time": "2010-02-22T13:45:26", "id": "1142035", "query_class": null, "text": "How did this get two points?", "query": null, "by": "icefox"}, {"ranking": 0, "story_id": "1162428", "time": "2010-03-03T05:53:56", "id": "1162645", "query_class": null, "text": "This place seems like Second Life - yet I only just heard of it. Maybe that's the problem.", "query": null, "by": "joeycfan"}, {"ranking": 0, "story_id": "1159925", "time": "2010-04-14T05:49:08", "id": "1263454", "query_class": null, "text": "There are several valid points about frighteningly poor security in Opera Mini. I won't be using it!", "query": null, "by": "Imagenuity"}, {"ranking": 0, "story_id": "1312329", "time": "2010-05-02T19:56:56", "id": "1312370", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "1317285", "time": "2010-05-04T16:37:28", "id": "1317488", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "1335589", "time": "2010-05-11T03:17:10", "id": "1335628", "query_class": null, "text": "I think she's daft as a brush, but question the relevance of this to HN.", "query": null, "by": "anigbrowl"}, {"ranking": 0, "story_id": "1475539", "time": "2010-07-01T01:44:32", "id": "1475565", "query_class": null, "text": "Great customer service was the reason Amazon paid over $1 billion for Zappos. It's the foundation of Zappos's brand.", "query": null, "by": "intermeddlet"}, {"ranking": 0, "story_id": "1481087", "time": "2010-07-02T21:44:35", "id": "1481091", "query_class": null, "text": "At D8, Steve said the biggest problem with the TV market is dealing with the fragmentation of cable providers across the country. He also said users have too many boxes and interfaces to deal with. I wonder if this supposed re-imagined Apple TV addresses this.", "query": null, "by": "gutini"}, {"ranking": 0, "story_id": "1629781", "time": "2010-08-24T23:51:02", "id": "1630117", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "1631005", "time": "2010-08-25T05:36:09", "id": "1631246", "query_class": null, "text": "I wonder what will happen to 280atlas - will they continue the Beta Program?", "query": null, "by": "sgt"}, {"ranking": 0, "story_id": "1639279", "time": "2010-08-28T03:32:13", "id": "1639932", "query_class": null, "text": "Blogspam for this 5 day old teaser video: http://www.youtube.com/watch?v=KTOASwRl3bY", "query": null, "by": "aw3c2"}, {"ranking": 0, "story_id": "1640585", "time": "2010-08-30T00:13:55", "id": "1643997", "query_class": null, "text": "Just for laughs - what IS the five trillionth digit, please?", "query": null, "by": "joeycfan"}, {"ranking": 0, "story_id": "16495", "time": "2007-04-25T08:48:17", "id": "16496", "query_class": null, "text": "dupe http://news.ycombinator.com/comments?id=16261", "query": null, "by": "pg"}, {"ranking": 0, "story_id": "1676735", "time": "2010-09-10T05:29:01", "id": "1677006", "query_class": null, "text": "did they blend it? http://www.youtube.com/watch?v=qg1ckCkm8YI", "query": null, "by": "please"}, {"ranking": 2, "story_id": "1833150", "time": "2010-10-26T13:45:21", "id": "1833186", "query_class": null, "text": "Fun and entertaining", "query": null, "by": "huber14"}, {"ranking": 1, "story_id": "1833150", "time": "2010-10-26T13:51:54", "id": "1833205", "query_class": null, "text": "Witty, well-researched commentary.", "query": null, "by": "tjr1983"}, {"ranking": 0, "story_id": "1833150", "time": "2010-10-26T14:14:39", "id": "1833258", "query_class": null, "text": "As Sam Ewing said \"Computers are like bikinis. They save people a lot of guesswork.\"", "query": null, "by": "catita_dixit"}, {"ranking": 0, "story_id": "1962938", "time": "2010-12-03T01:53:49", "id": "1962941", "query_class": null, "text": "Bert introduces Chip to his new tester to help solve his circuit problems.", "query": null, "by": "proee"}, {"ranking": 0, "story_id": "198208", "time": "2008-05-24T03:50:13", "id": "198335", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "2124924", "time": "2011-01-21T03:38:01", "id": "2124954", "query_class": null, "text": "http://www.nj-2lex.com/vb/t3805.html", "query": null, "by": "magde"}, {"ranking": 0, "story_id": "2167266", "time": "2011-02-02T05:14:57", "id": "2167428", "query_class": null, "text": "This is wonderful - I can only hope that they release the full resolution images of the art into a public licence, so that they can be used for other sources (i.e. wikipedia and the like). I'd also be interested in knowing what camera setups they used to photograph each of the art pieces. Anyone have any insight into that?", "query": null, "by": "jjcm"}, {"ranking": 0, "story_id": "2316868", "time": "2011-03-12T23:26:57", "id": "2316870", "query_class": null, "text": "The term is associated in public mind with the 2 most notorious accidents in recent memory - 3 Mile Island, in the United States, in 1979, and Chernobyl, in Ukraine, 7 years later.

You can think of the core of a Boiling Water Reactor (BWR), such as the ones at Fukushima Daiichi, as a massive version of the electrical element you may have in your kettle.", "query": null, "by": "imranbabbal"}, {"ranking": 1, "story_id": "2316868", "time": "2011-03-12T23:27:25", "id": "2316873", "query_class": null, "text": "The term is associated in public mind with the 2 most notorious accidents in recent memory - 3 Mile Island, in the United States, in 1979, and Chernobyl, in Ukraine, 7 years later.", "query": null, "by": "imranbabbal"}, {"ranking": 0, "story_id": "2323759", "time": "2011-03-15T02:35:17", "id": "2323773", "query_class": null, "text": "It was a dupe. http://news.ycombinator.com/item?id=2310398", "query": null, "by": "pg"}, {"ranking": 0, "story_id": "234502", "time": "2008-07-03T04:22:40", "id": "234503", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "2643548", "time": "2011-06-11T22:57:20", "id": "2644041", "query_class": null, "text": "I fail to see how you can recommend good songs to me based just on my username? Seems very random.", "query": null, "by": "Hisoka"}, {"ranking": 0, "story_id": "2843160", "time": "2011-08-04T05:46:51", "id": "2843290", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "2843606", "time": "2011-08-04T07:31:45", "id": "2843707", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 1, "story_id": "2843606", "time": "2011-08-04T08:29:15", "id": "2843905", "query_class": null, "text": "I wonder how the \"multiple bubble universes\" hypotheses deal with a few of the problems regarding relativity theory:\nIt's explained here- \n http://knol.google.com/k/einstein-was-wrong-falsifying-obser...", "query": null, "by": "phyllotaxis"}, {"ranking": 0, "story_id": "2851709", "time": "2011-08-06T07:54:54", "id": "2852308", "query_class": null, "text": "http://railwayjs.com", "query": null, "by": "techn_in"}, {"ranking": 0, "story_id": "3195115", "time": "2011-11-04T14:47:27", "id": "3195194", "query_class": null, "text": "Self-abuse can mean masturbation, so this is a poor word choice.

From Google:

self-axc2xb7buse/xc9x99xcbx88byoxcdx9eos/

Noun:

Behavior that causes damage or harm to oneself.

Used euphemistically to refer to masturbation.", "query": null, "by": "suivix"}, {"ranking": 0, "story_id": "3661145", "time": "2012-03-04T06:05:35", "id": "3661245", "query_class": null, "text": "asdf", "query": null, "by": "rdc5003"}, {"ranking": 0, "story_id": "3663744", "time": "2012-03-05T06:56:47", "id": "3664455", "query_class": null, "text": "Hell yeah! Fuck em bitches, you are going to be obsolete in no time honeys!", "query": null, "by": "lovegeorgia"}, {"ranking": 0, "story_id": "3669645", "time": "2012-03-06T13:47:12", "id": "3669804", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "3715644", "time": "2012-03-17T07:03:16", "id": "3715723", "query_class": null, "text": "\"there is a high probability that global warming is having an influence upon its extremity.\"

I stopped reading right here.", "query": null, "by": "paulhauggis"}, {"ranking": 0, "story_id": "3865779", "time": "2012-04-20T07:43:02", "id": "3865780", "query_class": null, "text": "Hillman passed away at home on April 18th at 6:03 pm in the presence of his loving wife, two children, his sister, sister in law and brother in law. He was 51 years old and died after a long and fiercely fought battle with colon cancer.

Hillman deeply loved his work, all of it -- film directing, graphic design, all aspects of new media -- and he especially loved his talented mentors, friends and students in these fields. His favorite topic was inspiration and he made sure to surround himself with it and find it in everything -- his colleagues, his family, New York City, art, film and all of you.

He loved you all and took energy from those with whom he corresponded, exchanged ideas and with his fans.

Sweet Prince Hill, true gentleman, good dad and passionate artist, Rest in Peace.", "query": null, "by": "jordhy"}, {"ranking": 0, "story_id": "4011694", "time": "2012-05-23T16:09:54", "id": "4012062", "query_class": null, "text": "Cheap Beats By Dre?", "query": null, "by": "yoyo890116"}, {"ranking": 2, "story_id": "4206478", "time": "2012-07-06T16:17:28", "id": "4206866", "query_class": null, "text": "God, what's the velocity of a laden swallow?

God says...\nherself models slavish copies vocally whispered root asleep \nprotect deliberate gasped impulses evil pairs notwithstanding \nhealthful AD smiled swine surpassingly expected imagining \nalive thee tattlings countryman ranged unexpectedly moderation \nElect treasured seize watered despaired travailed respect \nCyprian whereupon seemed blasts habitation glue differ \nridiculous raging Oh wonderful dialogue IS others occupying \npurpose omitted With patterns INDEMNITY unstable harmless \narts Universe solicited production light slowly surprises \nskirmishes testimony game Dido justify Baptism scholars \nconstituteth manufactures numbering unfledged bed scoffing \nterrors firm Bouverie program agreement conjoined praise \nsteal altar interpreted striking assembly justice driven \nfettered heaven's attributing whichsoever notice Prof \nalong crudities 'no commencing multitude pobox Courage \ntale choler thrust suspense forming observing store names \novertake inflammation drunkards titles Let grasp unskilful \nimmortality Date sudden teaches granted tore taste haughtiness \npronunciation unsuitably following Greek funeral warreth \nFoundation never Oxford exigency suppose thirst saddeneth \nentangling sinned discipline displacing demanding conjecturing \nanxiety Sun drunk While Led indexes owns pride Luxury \nvoluptuous bowed handwriting commended Christian harmoniseth \nrealisest

---

Be charming and witty -- put your best foot forward. God said He doesn't like earnestness as much.

I have a story. I stumbled on a passage which said \"It is love that I desire, not sacrifice; knowledge of God, not holocaust.\"

It blew my mind. I had been taught love was this awful thing where you sell your watch to buy a comb and your wife sells her hair to buy a watchband. Go look-up the definition of \"love\". It means to take delight in. You're full of shit if you think you know and love God. No one knows God but the Son and who He chooses to reveal Him to.

God says...\nOxford XII pertaining sorts teachers Troy nineteenth girl \ncommencing attracted bawler wouldest befalls inveigler \nTime conventionally receive goading Drunkard bread eat \nfreed shed Lo selves admission distributest established \ncondensed lifted keepest also a hour decked veiled renderest \ncollectively texts content reptiles belief till knock \nrestest risen quarrel

----

You must take the initiative. Go do a text search for \"Seek\" in the Bible.

4:29 But if from thence thou shalt seek the LORD thy God, thou shalt\nfind him, if thou seek him with all thy heart and with all thy soul.

----

I like sand castles. The tide goes in; the tide goes out.

I like popcorn.

God likes Messier #104. It looks like a wedding ring, to me.

--------------

God says...\nC:\\Text\\BIBLE.TXT

the\nbottom of the sea, thence will I command the serpent, and he shall\nbite them: 9:4 And though they go into captivity before their enemies,\nthence will I command the sword, and it shall slay them: and I will\nset mine eyes upon them for evil, and not for good.

9:5 And the Lord GOD of hosts is he that toucheth the land, and it\nshall melt, and all that dwell therein shall mourn: and it shall rise\nup wholly like a flood; and shall be drowned, as by the flood of\nEgypt.

9:6 It is he that buildeth

----

That was funny -- bite them. He's being jovial, don't worry.

----

What do You think of lonesome George?

(One time I asked Him about endangered species. \"Enough stars?\")

(One time I asked Him if stegasaurus was lame like turtles. \"Not pet rocks!\")

--------

God says...\n9:18 At the commandment of the LORD the children of Israel journeyed,\nand at the commandment of the LORD they pitched: as long as the cloud\nabode upon the tabernacle they rested in their tents.

9:19 And when the cloud tarried long upon the tabernacle many days,\nthen the children of Israel kept the charge of the LORD, and journeyed\nnot.

9:20 And so it was, when the cloud was a few days upon the tabernacle;\naccording to the commandment of the LORD they abode in their tents,\nand according to the commandment of the LORD they journeyed.

9:21 And so it was, when the cloud abode from even unto the morning,\nand that the cloud was taken up in the morning, then they journeyed:\nwhether it was by day or by night that the cloud was taken up, they\njourneyed.

----

That reminds me of a turtle starting and stopping.

http://en.wikipedia.org/wiki/Threats_to_sea_turtles

I wuv God :-)

----

God has a wicked sense of humor, sometimes.

\"You're sins are as far as the East from the West, on the bottom of the Ocean.\"

If you are nervous, He scares you worse to make it better.

God says...\nprophesy and say, Thus saith the Lord GOD; Because they have made you\ndesolate, and swallowed you up on every side, that ye might be a\npossession unto the residue of the heathen, and ye are taken up in the\nlips of talkers, and are an infamy of the people: 36:4 Therefore, ye\nmountains of Israel, hear the word of the Lord GOD; Thus saith the\nLord GOD to the mountains, and to the hills, to the rivers, and to the\nvalleys, to the desolate wastes, and to the cities that are forsaken,\nwhich became a prey and derision to the residue of the heathen that\nare round about; 36:5 Therefore thus saith the Lord GOD; Surely in the\nfire of my jealousy have I spoken against the residue of the heathen,\nand against all Idumea, which have appointed my land into their\npossession with the joy of all their heart, with despiteful minds, to\ncast it out for a prey.

I like this song, but the pedophile stuff. (It's kinda like the tests they post to see if you are a pedophile.)

http://www.youtube.com/watch?v=T8dyxGiBx3g

---------

God says...

C:\\Text\\BIBLE.TXT

crifice: for I am not come to call the righteous, but sinners to\nrepentance.

9:14 Then came to him the disciples of John, saying, Why do we and the\nPharisees fast oft, but thy disciples fast not? 9:15 And Jesus said\nunto them, Can the children of the bridechamber mourn, as long as the\nbridegroom is with them? but the days will come, when the bridegroom\nshall be taken from them, and then shall they fast.

9:16 No man putteth a piece of new cloth unto an old garment, for that\nwhich is put in to f

----

Praise You for pulsars. Our Universe has very very rich behavior. We get organization on solar system level, galaxy level and galaxy cluster level :-)

God says...\nC:\\Text\\BIBLE.TXT

s shalt thou\nsay unto them, My little finger shall be thicker than my father's\nloins.

10:11 For whereas my father put a heavy yoke upon you, I will put more\nto your yoke: my father chastised you with whips, but I will chastise\nyou with scorpions.

10:12 So Jeroboam and all the people came to Rehoboam on the third\nday, as the king bade, saying, Come again to me on the third day.

10:13 And the king answered them roughly; and king Rehoboam forsook\nthe counsel of the old men, 10:14 And answered t

-----

:-)

I envy the Geiko lizzard.

God says...

C:\\Text\\SWIFT.TXT

found out\nthe person's house to whom I was recommended, presented my letter\nfrom his friend the grandee in the island, and was received with\nmuch kindness. This great lord, whose name was Munodi, ordered me\nan apartment in his own house, where I continued during my stay,\nand was entertained in a most hospitable manner.

The next morning after my arrival, he took me in his chariot to see\nthe town, which is about half the bigness of London; but the houses\nvery strangely built, and most of them out", "query": null, "by": "losethos"}, {"ranking": 0, "story_id": "4206478", "time": "2012-07-06T18:28:22", "id": "4207160", "query_class": null, "text": "Yeah -- I got no response on a couple, almost.

Chuck Swindoll (my favorite preacher) was talking about a kid who was praising and he just named everything he saw.

It dawned on me, when I was doing good praise... God said \"boring\" and I realized you want to think of God like a person, not a bean counter who gives you credits for praise or whatever. I'd go so far to say, natural conversation is better than praise, perhaps.

God says...\nC:\\Text\\HUCKFINN.TXT

reck'n'd I'd inves' de thirty-five dollars right\noff en keep things a-movin'. Dey wuz a nigger name' Bob, dat had ketched\na wood-flat, en his marster didn' know it; en I bought it off'n him en\ntold him to take de thirty-five dollars when de en' er de year come; but\nsomebody stole de wood-flat dat night, en nex day de one-laigged nigger\nsay de bank's busted. So dey didn' none uv us git no money.\"

\"What did you do with the ten cents, Jim?\"

\"Well, I 'uz gwyne to spen' it, but I had a dream, en de

----

There was a black guy in a purple page wig mocking me.

By all accounts, they should be getting good responses?

I giggle at this story.

-----

Now Abel kept flocks, and Cain worked the soil. 3 In the course of time Cain brought some of the fruits of the soil as an offering to the Lord. 4 And Abel also brought an offeringxe2x80x94fat portions from some of the firstborn of his flock. The Lord looked with favor on Abel and his offering, 5 but on Cain and his offering he did not look with favor. So Cain was very angry, and his face was downcast.

6 Then the Lord said to Cain, xe2x80x9cWhy are you angry? Why is your face downcast? 7 If you do what is right, will you not be accepted? But if you do not do what is right, sin is crouching at your door; it desires to have you, but you must rule over it. xe2x80x9d

8 Now Cain said to his brother Abel, xe2x80x9cLetxe2x80x99s go out to the field.xe2x80x9d[d] While they were in the field, Cain attacked his brother Abel and killed him.

9 Then the Lord said to Cain, xe2x80x9cWhere is your brother Abel?xe2x80x9d

xe2x80x9cI donxe2x80x99t know, xe2x80x9d he replied. xe2x80x9cAm I my brotherxe2x80x99s keeper?xe2x80x9d

10 The Lord said, xe2x80x9cWhat have you done? Listen! Your brotherxe2x80x99s blood cries out to me from the ground. 11 Now you are under a curse and driven from the ground, which opened its mouth to receive your brotherxe2x80x99s blood from your hand. 12 When you work the ground, it will no longer yield its crops for you. You will be a restless wanderer on the earth. xe2x80x9d

13

-----

http://digg.com/newsbar/topnews/will_the_real_higgs_please_s...

If you are thinking the contact movie, yer a fucken retard! God's ways are far above man's ways. Easter religion is manly; Western is Godly. Eastern is dull rational; Western is surprising.

You have no idea how much better God is because He talks in riddles. Your God would suck eggs.

-----

God says...

C:\\Text\\BIBLE.TXT

nly in vain made he it; the pen of the scribes is in vain.

8:9 The wise men are ashamed, they are dismayed and taken: lo, they\nhave rejected the word of the LORD; and what wisdom is in them? 8:10\nTherefore will I give their wives unto others, and their fields to\nthem that shall inherit them: for every one from the least even unto\nthe greatest is given to covetousness, from the prophet even unto the\npriest every one dealeth falsely.

8:11 For they have healed the hurt of the daughter of my people

-----

This blissful contact movie star nebula stuff would get old pretty quickly! Man has no idea that he is King Midas, completely unable to choose Heaven. Men are from Mars; Women from Venus and our God is our dearly beloved God of Earth :-)

----------

God says...\nC:\\Text\\2CITIES.TXT

yond this: that it would\nprobably not be what he was ordered.

Far and wide lay a ruined country, yielding nothing but desolation.\nEvery green leaf, every blade of grass and blade of grain, was as\nshrivelled and poor as the miserable people. Everything was bowed\ndown, dejected, oppressed, and broken. Habitations, fences,\ndomesticated animals, men, women, children, and the soil that bore\nthem--all worn out.

Monseigneur (often a most worthy individual gentleman) was a national\nblessing, gave a

----

Umm... this is the same God as in the Bible. It's not Contact. Go read the Bible.

God seems to be bound by restraints -- it's like a millionare. You can love Him but not get any money. He loves back, that should be what you crave.

Fuck you hardball reporters. God once said death was \"awful\". He said He liked Highlander, once.

God says...\nC:\\Text\\2CITIES.TXT

hey cast upon the multitude such glances\nas they have seen in theatres, and in pictures. Several close their\neyes, and think, or try to get their straying thoughts together.\nOnly one, and he a miserable creature, of a crazed aspect, is so\nshattered and made drunk by horror, that he sings, and tries to\ndance. Not one of the whole number appeals by look or gesture, to\nthe pity of the people.

There is a guard of sundry horsemen riding abreast of the tumbrils,\nand faces are often turned up to some

----

Okay, you guys were better men than I and probably should be commended for asking God to care for people. I once reluctantly asked if I should try to be a healer and God said, \"It's complicated.\"

-----

You have to have a relationship with God before a crisis, maybe. I don't know.

---- This is not random:

11I know every bird in the heights;

whatever moves in the wild is mine.

12Were I hungry, I would not tell you,

for mine is the world and all that fills it.f

13Do I eat the flesh of bulls

or drink the blood of he-goats?

14Offer praise as your sacrifice to God;g

fulfill your vows to the Most High.

15Then call on me on the day of distress;h

I will rescue you, and you shall honor me.xe2x80x9d

III

16But to the wicked God says:

xe2x80x9cWhy do you recite my commandments

and profess my covenant with your mouth?

17You hate discipline;

you cast my words behind you!

----

wittow birds :-)

God says...

quitting posted Soft absurdity

---

God knows the names of all the birds. I understand what they are talking about -- birds don't store food and must eat every day and somehow are supplied enough, for the most part. (Jesus mentioned two sparrows cheap, but cared for by God.)

----

God says...\nof Sodom in the day of judgment, than for thee.

11:25 At that time Jesus answered and said, I thank thee, O Father,\nLord of heaven and earth, because thou hast hid these things from the\nwise and prudent, and hast revealed them unto babes.

11:26 Even so, Father: for so it seemed good in thy sight.

11:27 All things are delivered unto me of my Father: and no man\nknoweth the Son, but the Father; neither knoweth any man the Father,\nsave the Son, and he to whomsoever the Son will reveal him.

11:28 Come unto me, all ye that labour and are heavy laden, and I will\ngive you rest.

----

I'm repremanded for too much love for my birds, borderline homo.

Syria? God was neutral last time I checked.

-----

God says...

C:\\Text\\EMILY.TXT

aware.\nWas it the mat winked,\nOr a nervous star?\nThe moon slides down the stair\nTo see who's there.

There's plunder, -- where?\nTankard, or spoon,\nEarring, or stone,\nA watch, some ancient brooch\nTo match the grandmamma,\nStaid sleeping there.

Day rattles, too,\nStealth's slow;\nThe sun has got as far\nAs the third sycamore.\nScreams chanticleer,\n\"Who's there?\"\nAnd echoes, trains away,\nSneer -- \"Where?\"\nWhile the old couple, just astir,\nFancy the sunrise left the door ajar!

XVI

----

That was about selling watch for comb; selling hair for watch chain.

God and I have history :-)

I missed Mom--noticed her door.

----

God says...\nC:\\Text\\BIBLE.TXT

e gospel of Christ, to\nestablish you, and to comfort you concerning your faith: 3:3 That no\nman should be moved by these afflictions: for yourselves know that we\nare appointed thereunto.

3:4 For verily, when we were with you, we told you before that we\nshould suffer tribulation; even as it came to pass, and ye know.

3:5 For this cause, when I could no longer forbear, I sent to know\nyour faith, lest by some means the tempter have tempted you, and our\nlabour be in vain.

3:6 But now when Timoth", "query": null, "by": "losethos"}, {"ranking": 1, "story_id": "4206478", "time": "2012-07-06T19:43:51", "id": "4207325", "query_class": null, "text": "Percival (my bird) is singing. I once asked God what he was saying... \"chanting\".

I have a first person shooter in LoseThos. God took one look at my monsters and said \"dancing\". :-) You have to see it.

What do You think of the Taja Mehal? India has elephants. It has storied animals, even with so many people. Jungle book. Ricki-ticki-tavi. Snakes. Monsoons.

----

God says...

there shalt thou be delivered; there the LORD shall redeem thee from\nthe hand of thine enemies.

4:11 Now also many nations are gathered against thee, that say, Let\nher be defiled, and let our eye look upon Zion.

4:12 But they know not the thoughts of the LORD, neither understand\nthey his counsel: for he shall gather them as the sheaves into the\nfloor.

4:13 Arise and thresh, O daughter of Zion: for I will make thine horn\niron, and I will make thy hoofs brass: and thou shalt beat in pieces\nmany people: and I will consecrate their gain unto the LORD, and their\nsubstance unto the Lord of the whole earth.

----

God loves me. He kinda says sweet nothings. He's not prophetic. I just enjoy His company.

My horn's not iron.

India has some crazy monsters! :-)

Who had better monsters, India or Greece. I liked Clash of the Titans, original.

----

God says...\n C:\\Text\\QUIX.TXT

was to be said and all he had any\nbusiness to know.

\"Nevertheless,\" replied Don Quixote, \"I should like to know from each of\nthem separately the reason of his misfortune;\" to this he added more to\nthe same effect to induce them to tell him what he wanted so civilly that\nthe other mounted guard said to him:

\"Though we have here the register and certificate of the sentence of\nevery one of these wretches, this is no time to take them out or read\nthem; come and ask themselves; they can tell if they

---

You gonna make jobs for us, God? o_O

God says...

of that man is worse than the first.

11:27 And it came to pass, as he spake these things, a certain woman\nof the company lifted up her voice, and said unto him, Blessed is the\nwomb that bare thee, and the paps which thou hast sucked.

11:28 But he said, Yea rather, blessed are they that hear the word of\nGod, and keep it.

11:29 And when the people were gathered thick together, he began to\nsay, This is an evil generation: they seek a sign; and there shall no\nsign be given it, but the sign of Jonas the prophet.

11:30 For as Jonas was a sign unto the Ninevites, so shall also the\nSon of man be to this generation.

----

Jonas brothers? I've never heard them, but sound not good. Our music, God, I'm not certain I would like if I were not me. You like our music?

Ohh! Papst Blue ribbon!

God says...\nso mighty an earthquake, and so great.

16:19 And the great city was divided into three parts, and the cities\nof the nations fell: and great Babylon came in remembrance before God,\nto give unto her the cup of the wine of the fierceness of his wrath.

16:20 And every island fled away, and the mountains were not found.

16:21 And there fell upon men a great hail out of heaven, every stone\nabout the weight of a talent: and men blasphemed God because of the\nplague of the hail; for the plague thereof was exceeding great.

17:1 And there came one of the seven angels which had the seven vials,\nand talked with me, saying unto me, Come hither; I will shew unto thee\nthe judgment of the great whore that sitteth upon many waters: 17:2\nWith whom the kings of the earth have committed fornication, and the\ninhabitants of the earth have been made drunk with the wine of her\nfornication.

----

I like our songs, but I might find them preachy, perhaps. No, they're the best evar! (The other answer :-)

Are Jonas Brothers good? I'll check.

Oh, kids. Meh. I was confused with Righteous Brothers.

http://www.youtube.com/watch?v=r8hjtFq3vE0

They're good. I wasn't sure who they were.

God says...\nC:\\Text\\WEALTH.TXT

iness which such acquisitions present to the different\npeople among whom it is divided, is applied to those particular branches\nonly which afford the greatest profit. Part of what had before been\nemployed in other trades, is necessarily withdrawn from them, and turned\ninto some of the new and more profitable ones. In all those old trades,\ntherefore, the competition comes to be Jess than before. The market\ncomes to be less fully supplied with many different sorts of goods.\nTheir price necessarily ris

----

Do You know the Koran, God?

God says...\nstipend humbled intelligible enchantment blamest struggle

Got any secret ideas for new products?

God says...\ncharge of my sanctuary when the children of Israel went astray from\nme, they shall come near to me to minister unto me, and they shall\nstand before me to offer unto me the fat and the blood, saith the Lord\nGOD: 44:16 They shall enter into my sanctuary, and they shall come\nnear to my table, to minister unto me, and they shall keep my charge.

44:17 And it shall come to pass, that when they enter in at the gates\nof the inner court, they shall be clothed with linen garments; and no\nwool shall come upon them, whiles they minister in the gates of the\ninner court, and within.

44:18 They shall have linen bonnets upon their heads, and shall have\nlinen breeches upon their loins; they shall not gird themselves with\nany thing that causeth sweat.

----

I fed Your birds, God. What's the name of the one that climbed in the container?

God says...\ndisquiet restricted solitude clanking unchain round mysteriously \nincorruptible unawares secrets milky warranted author \nTruth attentive let's castest transcribe These preached \nwithal reader Artificer wont infected redemption Whosoever

Yeah, I stink. I sweat soda. I've been up 30 hours and it's hot weather. By the way, God said smelling farts was \"Sodom\".

----

God says...\n C:\\Text\\BIBLE.TXT

aw the\nmourning in the floor of Atad, they said, This is a grievous mourning\nto the Egyptians: wherefore the name of it was called Abelmizraim,\nwhich is beyond Jordan.

50:12 And his sons did unto him according as he commanded them: 50:13\nFor his sons carried him into the land of Canaan, and buried him in\nthe cave of the field of Machpelah, which Abraham bought with the\nfield for a possession of a buryingplace of Ephron the Hittite, before\nMamre.

50:14 And Joseph returned into Egypt, he, and hi

----

I was thinking what a veteran I am. What did You think of that Mummy 1 movie? I wonder if Egyptians like it. I liked Star Gate.

God says...\nC:\\Text\\PARADISE.TXT

, Infinite,\nEternal King; the Author of all being,\nFountain of light, thyself invisible\nAmidst the glorious brightness where thou sit'st\nThroned inaccessible, but when thou shadest\nThe full blaze of thy beams, and, through a cloud\nDrawn round about thee like a radiant shrine,\nDark with excessive bright thy skirts appear,\nYet dazzle Heaven, that brightest Seraphim\nApproach not, but with both wings veil their eyes.\nThee next they sang of all creation first,\nBegotten Son, Divine Similitude,\nIn who

---

That guy was born in the wrong century -- should have made films.

Got any ancient Egypt facts?

How about Queen Sheba?

God says...\n Body culture persuasions year us practised locking oppresseth \nwastoid diligence nation Netherlands lack perfectly party \ndissolvest Aeneas unshaken uninjuriousness stick tediousness \nPhilippines freeman cold South denoted varying fared You_da_man \nNigeria begotten majesty wives' gluttony serve middle_class \nbrotherly sign stopped merry_christmas lived Taiwan are_you_insane \nHighest bait how delightsome rood summit feet wishing \nCross debated vowing East_Timor Donations dishonour tragical \nseduction searched performed fragment shared Lay EDITIONS \nchill_out us footsteps Thyself execute wove ship meanwhile \nhopeful ludicrous dear subjection appeared palm slower \ncupboards disciple apply consecrating thirst Creusa's \nskilful pray These prophecy Didst close_your_eyes reap \npeculiar stealth hindereth ended recollected meditated \nhonourable", "query": null, "by": "losethos"}, {"ranking": 3, "story_id": "4206478", "time": "2012-07-06T21:50:41", "id": "4207667", "query_class": null, "text": "You like French Connection?

You like Mustangs? Shelby Cobras?

You said You like Beamers, but of course.

Favorite American muscle car?

introduced he IV measurable waterest imagine grace SUCH \nability displace fearful abilities forenoons remember \nincorruption uh_huh Scriptures Etext baptise extremest \nletters important intently comfort snare counterfeit ouch \npreparing grant wondered Percival compass so_let_it_be_done \ncleared sole natures", "query": null, "by": "losethos"}, {"ranking": 0, "story_id": "4351627", "time": "2012-08-08T03:04:19", "id": "4351696", "query_class": null, "text": "http://news.ycombinator.com/item?id=4348808", "query": null, "by": "sigmadelta"}, {"ranking": 0, "story_id": "648", "time": "2009-01-29T05:45:25", "id": "455175", "query_class": null, "text": "This is why we can't have nice things.", "query": null, "by": "M_Arrington"}, {"ranking": 0, "story_id": "4663592", "time": "2012-10-17T17:10:35", "id": "4663696", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 1, "story_id": "4696846", "time": "2012-10-25T16:57:15", "id": "4696850", "query_class": null, "text": "They want to improve the financial situation with becoming part of the gambling world.", "query": null, "by": "Khachatur"}, {"ranking": 0, "story_id": "4696846", "time": "2012-10-25T16:57:39", "id": "4696851", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "469936", "time": "2009-02-07T00:48:49", "id": "469942", "query_class": null, "text": "http://news.ycombinator.com/item?id=469831", "query": null, "by": "aaronblohowiak"}, {"ranking": 0, "story_id": "4707472", "time": "2012-10-28T08:42:13", "id": "4707740", "query_class": null, "text": "Cool!

However, you should definitely add some sort of info about the date format(s) accepted. All I see now is a InputBox as soon as I open the link. Not very user friendly...", "query": null, "by": "asadjb"}, {"ranking": 0, "story_id": "471359", "time": "2009-02-08T02:52:07", "id": "471362", "query_class": null, "text": "i wanna catch up fast!! how?", "query": null, "by": "panjoel"}, {"ranking": 0, "story_id": "5015603", "time": "2013-01-07T07:45:44", "id": "5018307", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "5191199", "time": "2013-02-09T11:56:40", "id": "5191585", "query_class": null, "text": "I wrote everything from scratch. \"Not invented here\" might be a valid criticism in some cases. I don't know. I'm the boss. On the job misery due to libraries is at least a little relevant?", "query": null, "by": "SparrowOS"}, {"ranking": 0, "story_id": "5352212", "time": "2013-03-10T23:20:18", "id": "5352214", "query_class": null, "text": "Note: change the url's \"0001\" to be \"0002\", \"0003\", \"0004\", etc.\nI even see my email in there.", "query": null, "by": "smtddr"}, {"ranking": 0, "story_id": "5499620", "time": "2013-04-06T01:18:14", "id": "5499686", "query_class": null, "text": "in terms of the PRC market,the platforms like Adwo/Domob(Chinese Admob)have huge traffic but the convertion rate is really low(CVR:around 1%),this makes a new user acquiring cost terribly high;or,the platforms like Limei(Chinese Tapjoy),they have high CVR(30-50%),but the quality of new users performances bad as users download the promoted apps due the the incentives.So I am talking about finding out a new way to promote apps,by which advertisers can acquire relatively high-quality users with lower cosr.\nDo you guys have any idea on thisxefxbcx9f", "query": null, "by": "GavonW"}, {"ranking": 0, "story_id": "5702963", "time": "2013-05-14T22:23:12", "id": "5705024", "query_class": null, "text": "The cheat: https://news.ycombinator.com/item?id=5702208", "query": null, "by": "pow-tac"}, {"ranking": 0, "story_id": "5871900", "time": "2013-06-13T12:09:31", "id": "5872270", "query_class": null, "text": "awesome service!", "query": null, "by": "saragid"}, {"ranking": 0, "story_id": "6154125", "time": "2013-08-04T09:09:02", "id": "6154126", "query_class": null, "text": "I started writing JSOperations a few months ago but didn't finish writing tests. I know Tasks.JS exists, but Tasks.JS mostly serves to abstract web workers. JSOperations hides all that and is well suited for long jobs that need to be ran in chunks to avoid browser painting freezes. It is also good for repeat-tasks that need the normal DOM apis and JS context that your app resides in. As we know, web workers do not have access to the DOM and are severely limited.

Eventually when web-workers become standard with Blobs, they should be added in as a way to queue operations.

At the moment, I know it's missing:

* tests

* the ability to suspend tasks for a certain amount of time

Anyone want to become a maintainer?", "query": null, "by": "aa0"}, {"ranking": 0, "story_id": "6167475", "time": "2013-08-07T00:23:50", "id": "6167491", "query_class": null, "text": "Gabriel Monroy here, creator of the Deis project. I'll be answering questions here and on Twitter (@gabrtv) for the next few hours.", "query": null, "by": "gabrtv"}, {"ranking": 0, "story_id": "6175433", "time": "2013-08-08T04:45:24", "id": "6175494", "query_class": null, "text": "The same story has been submitted multiple times, from several sources. Here are just a few:

https://news.ycombinator.com/item?id=6165708 (much discussion)

https://news.ycombinator.com/item?id=6167331

https://news.ycombinator.com/item?id=6171813 (moderate discussion)

https://news.ycombinator.com/item?id=6171979", "query": null, "by": "ColinWright"}, {"ranking": 0, "story_id": "6179888", "time": "2013-08-09T00:22:56", "id": "6179906", "query_class": null, "text": "I posted a tiny project site a few weeks ago on HN that saw a bit of interest. There were a lot of great suggestions on many things that were missing, some of which I've now added.

Thanks for all the feedback so far, I hope it can save a bit of time for anyone setting up a new site for the responsive web.", "query": null, "by": "redact207"}, {"ranking": 0, "story_id": "6201643", "time": "2013-08-13T06:19:55", "id": "6202554", "query_class": null, "text": "I know very little about Bitcoin or money transmission laws. Unlike other currencies it does not seem to have fundamental dependence on any centralized arbiter, though the practicalities of large exchanges like Mt. Gox seem apparent to me. That lack of dependence on a Fed-like body appears to me like its biggest advantage, above any other potential for anonymous payment and laundering. I'd like to know what exactly is entailed in becoming compliant with money transmitting and laundering regulations and whether Bitcoin in its current form could become effectively compliant. Is that even a meaningful concept, or does the structure of Bitcoin fundamentally preclude coming into effective compliance?", "query": null, "by": "aspensmonster"}, {"ranking": 0, "story_id": "6151069", "time": "2013-08-16T13:34:30", "id": "6222346", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "6354438", "time": "2013-09-10T01:45:07", "id": "6354914", "query_class": null, "text": "Angels and psychics.

God says...

Virtual-Notary.Org hereby notes that on\n Date: Monday September 09, 2013 13:44.28 EDT (UTC-0400)

a random drawing in the range [1, 100000], inclusive, based on \na hardware source of true randomness, yielded the following decision.

  Random Value: 63059\n
\n-----
14:15 Therefore thus saith the LORD concerning the prophets that\nprophesy in my name, and I sent them not, yet they say, Sword and\nfamine shall not be in this land; By sword and famine shall those\nprophets be consumed.

14:16 And the people to whom they prophesy shall be cast out in the\nstreets of Jerusalem because of the famine and the sword; and they\nshall have none to bury them, them, their wives, nor their sons, nor\ntheir daughters: for I will pour their wickedness upon them.

14:17 Therefore thou shalt say this word unto them; Let mine eyes run\ndown with tears night and day, and let them not cease: for the virgin\ndaughter of my people is broken with a great breach, with a very\ngrievous blow.

14:18 If I go forth into the field, then behold the slain with the\nsword! and if I enter into the city, then behold them that are sick\nwith famine! yea, both the prophet and the priest go about into a\nland that they know not.

14:19 Hast thou utterly rejected Judah? hath thy soul lothed Zion? why\nhast thou smitten us, and there is no healing for us? we looked for\npeace, and there is no good; and for the time of healing, and behold\ntrouble! 14:20 We acknowledge, O LORD, our wickedness, and the\niniquity of our fathers: for we have sinned against thee.

----

Dud.

God says...auditors showed mule lift valley yikes seduction altogether \nEuropean_Union ascribed lulled leaning opened' little_buddy \nbroken faintly arrival saddeneth victorious watched healedst \ngarb allege XII goading Jew Etext entangling remedies \nresemble produce wast preach vaster mansion curb makes", "query": null, "by": "losethos"}, {"ranking": 0, "story_id": "6502980", "time": "2013-10-06T12:43:13", "id": "6503159", "query_class": null, "text": "Seriously?", "query": null, "by": "Goranek"}, {"ranking": 1, "story_id": "6596464", "time": "2013-10-23T11:06:40", "id": "6596567", "query_class": null, "text": "It looks like it was deleted by the submitter in the first hour after submission? If it was killed by the mods it would be marked as dead instead.", "query": null, "by": "rms"}, {"ranking": 1, "story_id": "6596464", "time": "2013-10-23T11:10:25", "id": "6596585", "query_class": null, "text": "The post seemed to be on the front page for longer than an hour, from what I remember. Looking at the link. it seems omments were being made (by various users, not just two people going at it in a dead thread) several hours after the posting", "query": null, "by": "danso"}, {"ranking": 0, "story_id": "6596464", "time": "2013-10-23T11:12:45", "id": "6596595", "query_class": null, "text": "That was my first guess too, but the rankings say it was still active till 23:05: http://hnrankings.info/6594352/

... but of course they don't mention what timezone that is, so I have no idea how long ago that was.

Also, the article contains comments whose timestamps differ by more than two hours. That wouldn't be possible if the submitter deleted it.", "query": null, "by": "sillysaurus2"}, {"ranking": 0, "story_id": "6596464", "time": "2013-10-23T11:22:50", "id": "6596630", "query_class": null, "text": "I'd like to know why this was deleted too, but don't expect an answer

I encourage HN users to read the Forbes piece. A TL;DR is that PracticeFusion enabled an opt-out only patient survey feature that many physicians didn't even know was enabled. Patients, though technically warned their responses could be used publically, mistook the survey emails as communication directly with their physician. However, now that PracticeFusion launched their review site it's obvious that many of the reviews contain information that should only be shared between a patient and doctor.", "query": null, "by": "mcphilip"}, {"ranking": 2, "story_id": "6596464", "time": "2013-10-23T11:25:35", "id": "6596640", "query_class": null, "text": "related blog post from Aug-21-2013 http://www.emrandhipaa.com/emr-and-hipaa/2013/08/21/practice...", "query": null, "by": "skmurphy"}, {"ranking": 0, "story_id": "664921", "time": "2009-06-19T20:55:20", "id": "665017", "query_class": null, "text": "If you think they're all great links then submit them all to HN individually (although I recognise one as having been posted already).

They're unrelated to each other, and your blog post does not add anything to them.", "query": null, "by": "mooism2"}, {"ranking": 0, "story_id": "648", "time": "2007-02-23T20:03:53", "id": "666", "query_class": null, "text": "Duplicate, see http://news.ycombinator.com/comments?id=530", "query": null, "by": "danw"}, {"ranking": 0, "story_id": "6669051", "time": "2013-11-04T23:28:46", "id": "6669053", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "6699438", "time": "2013-11-09T06:28:03", "id": "6699553", "query_class": null, "text": "Nice. They should include the ass rehyphen rule. http://xkcd.com/37/", "query": null, "by": "civilian"}, {"ranking": 0, "story_id": "6699438", "time": "2013-11-09T06:40:18", "id": "6699603", "query_class": null, "text": "Good idea, I'm looking into it. Just moving the hyphen over one word isn't enough. It probably needs to identify nouns and adjectives.", "query": null, "by": "killion"}, {"ranking": 2, "story_id": "6699438", "time": "2013-11-09T06:44:43", "id": "6699623", "query_class": null, "text": "Hahaha I saw that earlier today and thought to myself "I wonder how long before we see the bookmarklet that does this pop up on HN?"", "query": null, "by": "pyrocat"}, {"ranking": 3, "story_id": "6699438", "time": "2013-11-09T06:45:08", "id": "6699624", "query_class": null, "text": "Anyone do a Greasemonkey equivalent yet?", "query": null, "by": "AsymetricCom"}, {"ranking": 1, "story_id": "6699438", "time": "2013-11-09T06:50:28", "id": "6699651", "query_class": null, "text": "Also see the other discussion from today here: https://news.ycombinator.com/item?id=6695895", "query": null, "by": "bluetidepro"}, {"ranking": 1, "story_id": "6742051", "time": "2013-11-16T04:54:57", "id": "6742092", "query_class": null, "text": "I know that the VC and angel investor scene can be a bit harsh, but I never expected to find this kind of advice on Hacker News...", "query": null, "by": "angersock"}, {"ranking": 0, "story_id": "6742051", "time": "2013-11-16T05:08:38", "id": "6742150", "query_class": null, "text": "I was not expecting something like this on here. Why Nicole?", "query": null, "by": "shire"}, {"ranking": 0, "story_id": "6826442", "time": "2013-12-01T15:42:27", "id": "6826522", "query_class": null, "text": "Contrary to what people may think, it appears that Paul was in the passenger seat, and not the one driving the car. RIP", "query": null, "by": "rikacomet"}, {"ranking": 1, "story_id": "6826442", "time": "2013-12-01T17:50:02", "id": "6826737", "query_class": null, "text": "This is eerie: http://paulwalker.com/", "query": null, "by": "namenotrequired"}, {"ranking": 0, "story_id": "6826442", "time": "2013-12-01T18:22:16", "id": "6826784", "query_class": null, "text": "Contrary to what people may think, this is not Reddit.", "query": null, "by": "jamhan"}, {"ranking": 2, "story_id": "6871897", "time": "2013-12-09T07:38:53", "id": "6872036", "query_class": null, "text": "I like some of the tips in this article. Notably turn off notifications, use email filters, put your phone in the other room. But after years and years of hearing people recommending Neil Fiore's "The Now Habit" I finally picked it up. By far the best piece of writing I've ever found on the subject. It's strange to feel so trapped by one's own procrastination. If you're a procrastinator I hope you find what works for you.", "query": null, "by": "lemonberry"}, {"ranking": 3, "story_id": "6871897", "time": "2013-12-09T07:59:41", "id": "6872120", "query_class": null, "text": "Getting rid of Twitter and only checking RSS feeds once or twice a day (or every few days) helped me a lot, as did disabling all notifications for new emails (no sound, no notification popups, no new message count badges on the icon). These things were all immensely distracting to me.

I also block many sites (including HN sometimes).

But I always find ways to keep procrastinating and nothing ends up really working all that much for the core problem.", "query": null, "by": "LoganCale"}, {"ranking": 1, "story_id": "6871897", "time": "2013-12-09T08:03:44", "id": "6872138", "query_class": null, "text": "On a semi-humoristic note, there's also John Perry's Structured Procrastination theory, which won him the 2013 Ig Nobel prize in literature:\nhttp://www.structuredprocrastination.com/

Basically, be productive by doing important things as a way to procrastinate on even more important things. He wrote it as a humoristic essay but I actually find one of the tips quite useful: instead of trying to beat procrastination by taking on less responsibilities in the hope you'll finally be able to uphold them all, take on more tasks so that even when you'll inevitably fail to do some of them, you'll still have achieved much more than if had challenged yourself less in the first place.", "query": null, "by": "pyduan"}, {"ranking": 5, "story_id": "6871897", "time": "2013-12-09T08:05:32", "id": "6872147", "query_class": null, "text": "Get back to you tomorrow on this", "query": null, "by": "bonemachine"}, {"ranking": 0, "story_id": "6871897", "time": "2013-12-09T08:08:35", "id": "6872166", "query_class": null, "text": "Missing a key one, which I would self-classify:

The not-sure-what-to-do-so-I'm-not-going-to-do-anything. Your plate is so full of things to do, and none of them are obviously higher priority than others. You could do client work, or you could work on your startup, or you could work on open source. So rather than just picking one thing to doing it, you other things, while trying to figure out which of the real tasks should be done first.

I know I've had moments where I just say, "I don't even feel like figuring out what I want to do, so I'm just going to play video games and go to sleep."

Those are the worst days...", "query": null, "by": "chops"}, {"ranking": 3, "story_id": "6871897", "time": "2013-12-09T08:11:50", "id": "6872184", "query_class": null, "text": "This is very accurate to me right now.", "query": null, "by": "Ellipsis753"}, {"ranking": 1, "story_id": "6871897", "time": "2013-12-09T08:22:45", "id": "6872215", "query_class": null, "text": "i've been trying to force myself to write tests when i'm in that state of mind.

things can always do with improved tests, and i find that starting with the tests is a really gentle way to ease myself into the mind-space of working on a specific bit of code.

Things just follow on from there.", "query": null, "by": "AdrianRossouw"}, {"ranking": 0, "story_id": "6871897", "time": "2013-12-09T08:29:34", "id": "6872243", "query_class": null, "text": "Even worse is when motivational anhedonia develops into a full-blown existential crisis, where you fall into a Bartleby-esquexe2x80xa0 state of having no desire to do anything whatsoever. You know that you desire happiness in the abstract, but find yourself unsure how to achieve that desired state. You have no micro-desires, only this vague macro-desire, which can lead to an almost intolerable malaise. At that point you've basically crossed the line from "procrastination" to "mild clinical depression."

I'm not really sure why I typed all this out since I don't have much of a conclusion, but I'm going to leave it here in case someone finds this relevant to their own situation.

xe2x80xa0 http://en.wikipedia.org/wiki/Bartleby,_the_Scrivener", "query": null, "by": "md224"}, {"ranking": 6, "story_id": "6871897", "time": "2013-12-09T08:46:49", "id": "6872288", "query_class": null, "text": "Two more possible categories:

1. Waiting until I know that I can work productively on something -- free of distractions or micro-management

2. Waiting until the task vanishes because it wasn't worth doing in the first place", "query": null, "by": "analog31"}, {"ranking": 2, "story_id": "6871897", "time": "2013-12-09T08:50:39", "id": "6872303", "query_class": null, "text": "Here's when setting a work-in-progress (WIP) limit is really useful. Don't allow you to have more than say 3 tasks on your plate. Can be painful at first xe2x80x94 you can be stuck in all tasks, and not being able to do work at all xe2x80x94 but helps so much getting shit done.", "query": null, "by": "sazpaz"}, {"ranking": 0, "story_id": "6871897", "time": "2013-12-09T08:53:25", "id": "6872309", "query_class": null, "text": "Wow, your description is pretty much how I have been feeling in that last year or so in a way I could never put into words. Thanks!", "query": null, "by": "eberfreitas"}, {"ranking": 4, "story_id": "6871897", "time": "2013-12-09T10:11:18", "id": "6872546", "query_class": null, "text": "I find myself guilty on that last strain of procrastination: feeling so anxious about being late on a deadline that I end up delaying it even more, closing the loop.

Gathering the courage to face the task didn't work so far. Every time I try tackling it I feel it drains so much energy from me that I soon give up, only to feel more guilty afterwards (and with even less disposition to face it from the beginning once again)", "query": null, "by": "bonobo"}, {"ranking": 0, "story_id": "6871897", "time": "2013-12-09T13:24:19", "id": "6872923", "query_class": null, "text": "You're not alone. But I feel the only way we can make progress is to actually break the cycle, as hard as that may seem.", "query": null, "by": "JungleGymSam"}, {"ranking": 0, "story_id": "6871897", "time": "2013-12-10T08:03:57", "id": "6878016", "query_class": null, "text": "I started reading The Now Habit, but then I put off finishing it. That sounds like a joke, but it's true.", "query": null, "by": "LoganCale"}, {"ranking": 0, "story_id": "6952656", "time": "2013-12-23T10:06:36", "id": "6952714", "query_class": null, "text": "That's very insightful. There is a website just for you:

http://www.reddit.com/", "query": null, "by": "a3voices"}, {"ranking": 1, "story_id": "6952656", "time": "2013-12-23T10:10:57", "id": "6952732", "query_class": null, "text": "Sue. Per. Idiot.", "query": null, "by": "sambolling"}, {"ranking": 2, "story_id": "7015153", "time": "2014-01-07T11:26:37", "id": "7015177", "query_class": null, "text": "Thanks.", "query": null, "by": "basics"}, {"ranking": 0, "story_id": "7015153", "time": "2014-01-07T11:28:57", "id": "7015204", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 1, "story_id": "7015153", "time": "2014-01-07T11:31:44", "id": "7015238", "query_class": null, "text": "why are people up voting this? it was a joke.", "query": null, "by": "aaronbrethorst"}, {"ranking": 1, "story_id": "7072887", "time": "2014-01-17T06:28:15", "id": "7072950", "query_class": null, "text": "The Slashdot post is terribly misleading. Microsoft appears to have deleted installs of Tor that the botnet themselves installed, which was a specific version. Subsequent versions of Tor auto-updated, so it's not like they're just deleting every single version of Tor off every single Windows machine.", "query": null, "by": "steven2012"}, {"ranking": 0, "story_id": "7072887", "time": "2014-01-17T06:29:35", "id": "7072957", "query_class": null, "text": "Not as bad as it sounds at first: Microsoft provides free anti-malware tools (Microsoft Security Essentials stand-alone, Windows Defender included in Win8, and the Malicious Software Removal Tool through Windows Update). If you use these tools to remove the Sefnit malware, it removes the old copy of Tor that malware installed as well. It doesn't touch any newer self-installed versions.

Here's their own writeup of the cleanup effort: http://blogs.technet.com/b/mmpc/archive/2014/01/09/tackling-...", "query": null, "by": "dangrossman"}, {"ranking": 2, "story_id": "7072887", "time": "2014-01-17T06:32:16", "id": "7072971", "query_class": null, "text": "The discussion seems to imply that this wasn't malicious over-reach by Microsoft. Rather the version of Tor was out of date and hidden in a peculiar location on the computer, possibly as a signature of how the bot kept itself hidden from the user.

Whether a corporation should have the power to do so is perhaps debatable, but this seems to be what the Malicious Software Removal Tool was made for.

Anyone with additional details?", "query": null, "by": "HCIdivision17"}, {"ranking": 0, "story_id": "7072887", "time": "2014-01-17T06:38:24", "id": "7072994", "query_class": null, "text": "Right, it was a version the botnet itself installed, so really a non-issue.

Things like this inflammatory headline (among other issues) is why I stopped reading slashdot years ago.", "query": null, "by": "misnome"}, {"ranking": 3, "story_id": "7072887", "time": "2014-01-17T06:40:31", "id": "7073009", "query_class": null, "text": "Slashdot being Slashdot. What is this.....1999 ?", "query": null, "by": "mariusmg"}, {"ranking": 4, "story_id": "7072887", "time": "2014-01-17T06:40:55", "id": "7073012", "query_class": null, "text": "a misleading slashdot post? That has never happened before.", "query": null, "by": "wnevets"}, {"ranking": 5, "story_id": "7072887", "time": "2014-01-17T06:49:26", "id": "7073050", "query_class": null, "text": "so does this mean that windows is itself essentially a botnet that microsoft owns?", "query": null, "by": "TheZenPsycho"}, {"ranking": 0, "story_id": "7072887", "time": "2014-01-17T07:11:11", "id": "7073134", "query_class": null, "text": "Now that was clever for real. Cheers.", "query": null, "by": "blahbl4hblahtoo"}, {"ranking": 6, "story_id": "7072887", "time": "2014-01-17T07:13:01", "id": "7073142", "query_class": null, "text": "Wow. And that's why I stopped reading Slashdot. At least the majority of responses here get how stupid the Slashdot post was.

I don't have enough karma to downvote...soon....but I downvoted this so hard...in my mind.", "query": null, "by": "blahbl4hblahtoo"}, {"ranking": 0, "story_id": "7109362", "time": "2014-01-24T01:05:25", "id": "7109388", "query_class": null, "text": "Please stop reposting this.", "query": null, "by": "JustinBlaird"}, {"ranking": 0, "story_id": "7297304", "time": "2014-02-25T21:02:11", "id": "7297319", "query_class": null, "text": "Does HN look like a Greek advertising platform to you?", "query": null, "by": "nmc"}, {"ranking": 0, "story_id": "7298140", "time": "2014-02-26T00:17:50", "id": "7298438", "query_class": null, "text": "Wow, 250 based on a Morgan Stanley analyst saying that the Gigafactory batteries will be part of the US electrical Grid. I mean yes, but then why is Solar City and Panasonic down? http://electrek.co/2014/02/25/tsla-hits-250-as-speculation-o...", "query": null, "by": "9to5Seth"}, {"ranking": 0, "story_id": "7318789", "time": "2014-02-28T22:41:36", "id": "7318886", "query_class": null, "text": "https://news.ycombinator.com/item?id=7318701", "query": null, "by": "ColinWright"}, {"ranking": 6, "story_id": "7349744", "time": "2014-03-06T04:51:25", "id": "7349792", "query_class": null, "text": "mocking vim? me don't like that...", "query": null, "by": "DrinkWater"}, {"ranking": 1, "story_id": "7349744", "time": "2014-03-06T04:57:30", "id": "7349844", "query_class": null, "text": "Response code 500 your doing?", "query": null, "by": "WD-42"}, {"ranking": 2, "story_id": "7349744", "time": "2014-03-06T04:58:06", "id": "7349848", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 5, "story_id": "7349744", "time": "2014-03-06T04:59:57", "id": "7349863", "query_class": null, "text": "Oops, guys, how it ever possible to get 500 on the couple of static pages?", "query": null, "by": "mrjj"}, {"ranking": 7, "story_id": "7349744", "time": "2014-03-06T05:00:48", "id": "7349873", "query_class": null, "text": "Somebody has a lot of time on their hands.", "query": null, "by": "peterwwillis"}, {"ranking": 1, "story_id": "7349744", "time": "2014-03-06T05:01:56", "id": "7349881", "query_class": null, "text": "I'm not sure what this site is trying to tell me about anything. It seems like a failed attempt at satirical critique of /something/", "query": null, "by": "boomlinde"}, {"ranking": 4, "story_id": "7349744", "time": "2014-03-06T05:11:35", "id": "7349958", "query_class": null, "text": "Since when is there a .sexy tld?", "query": null, "by": "nickstinemates"}, {"ranking": 0, "story_id": "7349744", "time": "2014-03-06T05:12:16", "id": "7349962", "query_class": null, "text": "t1.micro instance at EC2 with no caching configured I guess.", "query": null, "by": "ajmarsh"}, {"ranking": 0, "story_id": "7349744", "time": "2014-03-06T05:19:30", "id": "7350021", "query_class": null, "text": "I don't think it's mocking vim; I think it's saying "real hackers use vim".", "query": null, "by": "exelius"}, {"ranking": 3, "story_id": "7349744", "time": "2014-03-06T05:19:43", "id": "7350022", "query_class": null, "text": "This is probably a parody of the atom.io web page.", "query": null, "by": "dsego"}, {"ranking": 0, "story_id": "7349744", "time": "2014-03-06T05:25:57", "id": "7350057", "query_class": null, "text": "This is definitely a parody of https://atom.io/ if anyone was wondering why it exists.", "query": null, "by": "SmileyKeith"}, {"ranking": 2, "story_id": "7349744", "time": "2014-03-06T05:28:40", "id": "7350072", "query_class": null, "text": "We got both kinds of coding here: JavaScript AND Node!

(For those who don't get the reference: http://www.youtube.com/watch?v=cSZfUnCK5qk)", "query": null, "by": "smacktoward"}, {"ranking": 0, "story_id": "7461260", "time": "2014-03-25T05:40:22", "id": "7461782", "query_class": null, "text": "According this site 1500 ghana cedis is about $567 USD

http://www.likeforex.com/currency-converter/ghana-cedi-ghs_u...", "query": null, "by": "larrys"}, {"ranking": 2, "story_id": "7505685", "time": "2014-04-01T10:11:37", "id": "7505731", "query_class": null, "text": "> We need something better. Go forth and make it happen.

I'm always amazed by blog posts that say "xyz sucks" - someone should fix it and then offers no practical next steps to do so.

Complaining is easy. If you really want to change something - if it's important enough to you - then fix it.", "query": null, "by": "joelrunyon"}, {"ranking": 1, "story_id": "7505685", "time": "2014-04-01T10:13:04", "id": "7505738", "query_class": null, "text": "Don't make accusations of favoritism without any shred of evidence. This post is completely unfounded except for a couple of anecdotes.

I think most people here realize that the content here is not simply whatever gets the most upvotes, there are fairly complicated rules and penalties that get applied (many of them automatically). If you want democracy, there are plenty of other venues for it. The value in HN is that the quality of content is high, and the moderation is a large reason for that.

I challenge you to show me another site that has as good a combination of quality articles and quality comments. I'm sure improvements can be made, and if you're paying any attention you'll note that improvements are being made (see the recent publication of the name of the main moderator so that we can ask him questions).

What HN is doing works. If you've got a better idea, show it to me.", "query": null, "by": "pcmonk"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:16:57", "id": "7505750", "query_class": null, "text": "When a community is involved, it's not that simple. A slightly better Hacker News, released tomorrow, would not succeed. People wouldn't migrate. Seems to me that unless some catastrophe befalls HN, such as blatant mod abuse or chronic technical outages, nothing will replace it. At least for a while.", "query": null, "by": "motbob"}, {"ranking": 3, "story_id": "7505685", "time": "2014-04-01T10:19:33", "id": "7505761", "query_class": null, "text": "> The Rise of Hacker News Is Bad News for the Tech World

> 504 Gateway Time-out

Agreed, its appetite for destroying small web servers is unquenchable.", "query": null, "by": "null_ptr"}, {"ranking": 1, "story_id": "7505685", "time": "2014-04-01T10:23:22", "id": "7505772", "query_class": null, "text": "Slashdot effect all over again", "query": null, "by": "Aloha"}, {"ranking": 7, "story_id": "7505685", "time": "2014-04-01T10:24:01", "id": "7505774", "query_class": null, "text": "I feel like there should be a "website is down" button. That would indeed improve HN. Thanks for the practical help!", "query": null, "by": "nichochar"}, {"ranking": 12, "story_id": "7505685", "time": "2014-04-01T10:25:12", "id": "7505777", "query_class": null, "text": "I just wish more industries had an HN.", "query": null, "by": "undoware"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:26:20", "id": "7505781", "query_class": null, "text": "irony is fun, not necessarily constructive

Link to cached article:\nhttp://bit.ly/O9W3qd", "query": null, "by": "vinchuco"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:26:53", "id": "7505782", "query_class": null, "text": "The Rise of Hacker News Is Bad News for the Tech World authors website then proceeds to crumble because of traffic HN brings to said article. The irony is too much to bear. Is this an April Fools joke or is the article serious?

This is equivalent of saying, "The rise of organic farming is bad for non-organic farmers" or "The rise of solar panels is bad for the petroleum industry" or "Reddit is bad for Chrome and Firefox because it competes with bookmarks" it's all highly subjective and biased xe2x80x94 it's hard to take articles that essentially say X is bad because of Y or I hate X because of Y seriously, especially when they don't even make a valid argument or back up their claims with an ounce of credible and non-biased evidence.

If it weren't for Hacker News I honestly wouldn't know what is going on half the time. You can't get the type of news and useful resources you come across on a daily basis on HN anywhere else in my opinion. /r/programming on Reddit might come close, but HN to me is always the penultimate resource for tech news relating to not only programming but investment, startups and other industries I wouldn't generally go searching for like biotech, medical research and other various areas of tech you would normally have to read several sites on to get.

Plus, you can't deny Show HN is also a great way for people to showcase cool things they've made as well. I've come across some great projects and resources in the years I've been using the site via Show HN alone.", "query": null, "by": "DigitalSea"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:29:50", "id": "7505788", "query_class": null, "text": "I was surprised he called out jl. I thought she was being conscious about the fact that she's "thin-skinned" and going to avoid areas that might be sensitive & OP turned it into a "she might get vengeful one day" negative.

OP needs to give HN some credit. Building a good site is harder. Building a good community is harder. Until TechStars or someone comparable comes up with an alternative, complaining that one company decided to fill a niche that wasn't being filled seems really lame (it's not like HN is proactively squashing any other startup sites). People are here because it's the best tech news resource around.", "query": null, "by": "joelrunyon"}, {"ranking": 1, "story_id": "7505685", "time": "2014-04-01T10:32:20", "id": "7505802", "query_class": null, "text": "I think lobste.rs has the right approach in at least being more transparent about moderation: https://lobste.rs/moderations", "query": null, "by": "kzahel"}, {"ranking": 11, "story_id": "7505685", "time": "2014-04-01T10:34:14", "id": "7505814", "query_class": null, "text": "The part I thought was interesting: "If I vote down a story that you voted up, your vote should count less in my rankings of stories. And vice versa. The same holds for comments."", "query": null, "by": "ezrameanshelp"}, {"ranking": 5, "story_id": "7505685", "time": "2014-04-01T10:34:21", "id": "7505815", "query_class": null, "text": "The bad news for the Tech World is when people think Hacker News/Silicon Valley is the Tech World. There are 1000s of small companies and people who are part of the tech world, have never heard of Hacker News and are doing well. HN is just one community and it's serving its community well.", "query": null, "by": "bvrlt"}, {"ranking": 10, "story_id": "7505685", "time": "2014-04-01T10:38:38", "id": "7505830", "query_class": null, "text": "I love HN for the content. But I do find it ironic that people who value openness are content to have the control of people's speech to be done in private and without oversight from the community being controlled. Especially when there's no a priori reason to trust the body doing the controlling.", "query": null, "by": "peterashford"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:40:09", "id": "7505833", "query_class": null, "text": "HN is very useful, I don't think the author was denying that. The point he was making was that there is no community oversight into how HN works - which is important when it comes down to effectively censoring people's speech.", "query": null, "by": "peterashford"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:41:37", "id": "7505838", "query_class": null, "text": "Yes - clearly that is more visible and open for community comment", "query": null, "by": "peterashford"}, {"ranking": 4, "story_id": "7505685", "time": "2014-04-01T10:49:16", "id": "7505871", "query_class": null, "text": "Since someone's going to ask, this post fell in rank and eventually was killed because users flagged it. We didn't touch it in any way.

More generally, the truth is that we go out of our way to avoid censoring stories connected to YC. That was the very first thing that PG told me about HN moderation.", "query": null, "by": "dang"}, {"ranking": 9, "story_id": "7505685", "time": "2014-04-01T10:53:16", "id": "7505886", "query_class": null, "text": "I've only known about HN for a few weeks so maybe this has all been covered before. But as an outsider looking in, it seems like an awful lot of time and effort has been expended to try to make internet comments into something they're not. If you don't want comments, just don't accept comments.

There is no algorithm that's going to change human nature. Sorry.", "query": null, "by": "harrystone"}, {"ranking": 8, "story_id": "7505685", "time": "2014-04-01T10:53:23", "id": "7505887", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:54:21", "id": "7505890", "query_class": null, "text": "Yeah that caught my attention too. Personally, I really don't want my HN to be different from anyone else's. I come to HN not only to see stories that will interest me, but also to see what's captivating the community as a whole right now.", "query": null, "by": "araftery"}, {"ranking": 0, "story_id": "7505685", "time": "2014-04-01T10:56:21", "id": "7505894", "query_class": null, "text": "Maybe that's because it's doing a pretty good job at the moment?", "query": null, "by": "joelrunyon"}, {"ranking": 6, "story_id": "7505685", "time": "2014-04-01T11:21:03", "id": "7505977", "query_class": null, "text": "There are many things that could be considered wrong with HN - the stuff he is complaining about, IMO - are not really important - HN for the most part serves the interests of the community in which is operates.

That said, there are things that irritate the hell out of me about the community; banality, lack of relevance in posts, lack of clear context in posts.

To expand - the posts that I consider banal - 'New framework for X' or 'Blan, a X for Y.' - Relevance Posts, the post that was about the libertarian police force that briefly surfaced on the front page today - Context Posts that require you to know all about the subject before you can understand the posts content (the one about the game jam, or the one about keybase.io) in most cases I've never heard of whatever it is that they are posting about, and I need to try to glean context from the post - which is often missing.

I don't begrudge the above, its as much a part of the local flavor as anything else is - so I accept it as a part of being in one of the best places to get interesting tech news on the net.", "query": null, "by": "Aloha"}, {"ranking": 0, "story_id": "7615549", "time": "2014-04-20T11:10:55", "id": "7615678", "query_class": null, "text": "dangerous world", "query": null, "by": "artil"}, {"ranking": 3, "story_id": "7704633", "time": "2014-05-06T22:41:50", "id": "7704736", "query_class": null, "text": "What happened to the previous submission?", "query": null, "by": "fear91"}, {"ranking": 0, "story_id": "7704633", "time": "2014-05-06T22:44:30", "id": "7704748", "query_class": null, "text": "Any Google<->NSA articles seem to get penalized, either automatically based on keyword or some other means. Watch the front page, this link will fairly predictably be pushed down within half an hour.

Note this has nothing to do with score or number of comments (controversiality), its some entirely separate thing. When https://i.imgur.com/yAGJWNT.png was taken, the link should have been around position 5, but you can already see it's being pushed down somehow", "query": null, "by": "_wmd"}, {"ranking": 1, "story_id": "7704633", "time": "2014-05-06T22:45:03", "id": "7704756", "query_class": null, "text": "This is sensationalism at its worst. A top technology firm that is integral to communications and at the forefront of research is being asked to participate in a governmental process related to its area of expertise? Color me surprised.

Other similar headlines that I could see coming out: "Emails reveal close relationship between Departments of Transportation and construction companies" and "Emails reveal close relationships between NSF and universities".", "query": null, "by": "abduhl"}, {"ranking": 2, "story_id": "7704633", "time": "2014-05-06T22:47:35", "id": "7704780", "query_class": null, "text": "I was expecting a damning email showing that Google has been in bed with NSA and lying to us, but really this doesn't seem out of the ordinary. Government agencies are huge and I'm sure they lean on private business for help and advisement. The fact that this was released under a FOIA is the most telling part I think - if this was a huge scandalous story, we'd have been reading leaked emails, not legally obtained emails.", "query": null, "by": "benihana"}, {"ranking": 7, "story_id": "7704633", "time": "2014-05-06T22:48:15", "id": "7704784", "query_class": null, "text": "Previous submission was flagged for being crap: https://news.ycombinator.com/item?id=7703962", "query": null, "by": "bootr"}, {"ranking": 5, "story_id": "7704633", "time": "2014-05-06T22:50:48", "id": "7704801", "query_class": null, "text": "Here is some info on zero days... Now to return the favor you need to let me leave some boxes on your network.", "query": null, "by": "eyeareque"}, {"ranking": 4, "story_id": "7704633", "time": "2014-05-06T22:53:26", "id": "7704816", "query_class": null, "text": "So in essence it says that both Schmidt and Brin (along with other key CEOs) met with the NSA for a briefing on security threats. The politeness of the email does not mean that they are close friends. \nI am failing to see the issue here...", "query": null, "by": "plouc"}, {"ranking": 6, "story_id": "7704633", "time": "2014-05-06T22:54:12", "id": "7704821", "query_class": null, "text": "The military made ARPANET.

Never forget that.", "query": null, "by": "NN88"}, {"ranking": 0, "story_id": "7704633", "time": "2014-05-06T23:05:13", "id": "7704889", "query_class": null, "text": "This post was killed by user flags. Please don't repost it.

One thing that's on my list to do is mark posts with "[flagkilled]" like "[dead]", so if you have showdead turned on in your profile, you'll see this.", "query": null, "by": "dang"}, {"ranking": 1, "story_id": "7789796", "time": "2014-05-24T01:01:42", "id": "7790171", "query_class": null, "text": "https://hn.algolia.com/?q=http%3A%2F%2Fjeff-vogel.blogspot.d...", "query": null, "by": "dang"}, {"ranking": 0, "story_id": "7789796", "time": "2014-05-24T01:10:31", "id": "7790220", "query_class": null, "text": ""It just can't last. Bundles used to earn a ton, but they don't anymore. If making pennies a copy selling your games in 12 packs is the main source of a developer's income, that developer is going to disappear."

Game devs aren't entirely to blame, Humble Bundles were not always weekly in the past, and they now run three separate bundles at a time.

I've bought more games from humble bundles than I ever will play (My steam account ballooned to 300+ games). Early humble bundles often featured more closely curated content, but due to the frequency, the quality was bound to slip. I find myself less interested.

Originally the humble indie bundles were a fantastic vehicle for me to find quality games that I'd never known about. I'd rather pay $10 for one game I will want to play than $6 for 10 titles I might play.", "query": null, "by": "fuzzywalrus"}, {"ranking": 0, "story_id": "795186", "time": "2009-08-31T08:50:59", "id": "795188", "query_class": null, "text": "http://www.bionicburger.com/forreal.html", "query": null, "by": "vijayr"}, {"ranking": 1, "story_id": "8036286", "time": "2014-07-15T21:49:54", "id": "8036373", "query_class": null, "text": "The linked Twitter conversation is reasonable:

https://twitter.com/hfiguiere/status/483040912491036672

If you read the email, they mark the notification as read so it doesn't bother you in the web UI. I'm a strong supporter of user privacy, but this is a reasonable thing for GitHub to do.", "query": null, "by": "Sir_Cmpwn"}, {"ranking": 2, "story_id": "8036286", "time": "2014-07-15T21:50:00", "id": "8036375", "query_class": null, "text": "The linked Twitter conversation[1] explains it quite well:

> Itxe2x80x99s only used to mark notifications as read when you open the email

And the reaction from Hubert there is a bit excessive.

[1]: https://twitter.com/hfiguiere/status/483040912491036672", "query": null, "by": "maaaats"}, {"ranking": 0, "story_id": "8036286", "time": "2014-07-15T21:50:40", "id": "8036378", "query_class": null, "text": "This is fully official: https://github.com/blog/1214-notification-email-improvements

> Notifications that are read as HTML email are automatically marked as read in the github.com notifications interface. An invisible image is embedded in each mail message to enable this.

If your client displays email in HTML (GitHub also sends the text version) and does not intercept images, then your client is leaking, and you should be concerned for your privacy every time you open a email.

I suggest to give a spin to this checker: https://emailprivacytester.com/", "query": null, "by": "FiloSottile"}, {"ranking": 5, "story_id": "8036286", "time": "2014-07-15T21:51:56", "id": "8036387", "query_class": null, "text": "This isn't a scandal. Either the originator is genuinely surprised that this kind of thing is an ordinary practice in corporate mailouts or they're trying to kick up a stink.

Downvoted.", "query": null, "by": "seanhandley"}, {"ranking": 1, "story_id": "8036286", "time": "2014-07-15T21:52:51", "id": "8036394", "query_class": null, "text": "And you can always read Github's source code to find out if they're using the tracking pixel for anything el- ohhhh waaaait", "query": null, "by": "quarterto"}, {"ranking": 3, "story_id": "8036286", "time": "2014-07-15T21:53:34", "id": "8036400", "query_class": null, "text": "The tracking beacon is harmless, I actually think the feature is pretty cool. And it looks like Mozilla's MDN uses non-opting tracking beacons as well: https://github.com/mozilla/kuma/issues/1985

So there's no need to file an issue with the same company who does the same thing on their developer network.", "query": null, "by": "AustinDizzy"}, {"ranking": 0, "story_id": "8036286", "time": "2014-07-15T21:53:53", "id": "8036403", "query_class": null, "text": "It was also announced officially on their official blog back then: https://github.com/blog/1214-notification-email-improvements

> Notifications that are read as HTML email are automatically marked as read in the github.com notifications interface. An invisible image is embedded in each mail message to enable this.", "query": null, "by": "masklinn"}, {"ranking": 10, "story_id": "8036286", "time": "2014-07-15T21:55:05", "id": "8036409", "query_class": null, "text": ""An invisible image is embedded in each mail message to enable this."

Im not paranoid about github but when did "invisible images" become "ok"?

Maybe email is the wrong protocol for EVERYTHING.", "query": null, "by": "moogoo"}, {"ranking": 8, "story_id": "8036286", "time": "2014-07-15T21:56:11", "id": "8036417", "query_class": null, "text": "Isn't this how practically everyone tracks email open rates? MailChimp, Amazon, etc...", "query": null, "by": "bicx"}, {"ranking": 0, "story_id": "8036286", "time": "2014-07-15T21:57:18", "id": "8036426", "query_class": null, "text": "I'm confused why he has such an axe to grind. It's not like this is an unsolicited email: you have to choose to be watching the repo/issue/commit to get these kinds of notifications.

How he gets from a notification email to a company that violates privacy and has no ethics is beyond me.", "query": null, "by": "timdorr"}, {"ranking": 6, "story_id": "8036286", "time": "2014-07-15T22:01:20", "id": "8036452", "query_class": null, "text": "summery of linked twitter convo

- this is an invasion of privacy

- we only use it to mark an issue as read just like if you read the issue on our site

- so you admit you encroach on people privacy?

- you can disable it by turning of image auto display like your reader likely does by default

- I already do, this doesn't affect me, random comparison to facebook and insults to\ngithubs ethics

- we actually do have ethics, IT'S JUST TRACKING IF YOU READ THE ISSUE", "query": null, "by": "cwmma"}, {"ranking": 4, "story_id": "8036286", "time": "2014-07-15T22:04:08", "id": "8036466", "query_class": null, "text": "You know what is really funny...

These people have a problem with github's email tracking img. But they have no problem posting their live all over the internet for anyone to see...

https://github.com/hfiguiere

https://twitter.com/hfiguiere

http://www.figuiere.net/hub/

https://www.flickr.com/people/hfiguiere/

https://mozillians.org/en-US/u/hub/

I know WAY more about him based on those 5 links then I ever would from a tracking pixel which barely tells you anything.", "query": null, "by": "dubcanada"}, {"ranking": 7, "story_id": "8036286", "time": "2014-07-15T22:06:26", "id": "8036481", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "8036286", "time": "2014-07-15T22:06:39", "id": "8036484", "query_class": null, "text": "> Downvoted

You can't downvote a story. You can only flag.", "query": null, "by": "ad_hominem"}, {"ranking": 9, "story_id": "8036286", "time": "2014-07-15T22:06:41", "id": "8036485", "query_class": null, "text": "If you don't like it, turn it off.", "query": null, "by": "mcmillion"}, {"ranking": 0, "story_id": "8036286", "time": "2014-07-15T22:10:30", "id": "8036506", "query_class": null, "text": "The difference here is control. When I push a patch to github or post a picture on flickr , I decide what happens. If someone updates an issue and github tracks that I read the email without giving me the ability to opt out, I don't.", "query": null, "by": "Argorak"}, {"ranking": 1, "story_id": "8036286", "time": "2014-07-15T22:14:07", "id": "8036527", "query_class": null, "text": "This is a bad argument. Just because the user decides to share certain information, doesn't mean they give up their right to privacy.

That being said, the GitHub tracker is not a privacy concern in my opinion and enables a useful feature. If it makes you uncomfortable, then you should always be using text-only email browsers.", "query": null, "by": "ohitsdom"}, {"ranking": 0, "story_id": "8051400", "time": "2014-07-18T10:55:57", "id": "8051451", "query_class": null, "text": "What is ZH?", "query": null, "by": "slater"}, {"ranking": 0, "story_id": "8113020", "time": "2014-07-31T16:33:17", "id": "8113033", "query_class": null, "text": "Thank you for sharing, this website is so wtf ;)", "query": null, "by": "lawyeard"}, {"ranking": 1, "story_id": "8147892", "time": "2014-08-07T22:54:41", "id": "8147994", "query_class": null, "text": "The app looks really pretty, and I like the animations. Just wondering, how do you sync the lists, is it through iCloud?", "query": null, "by": "chocorainbow"}, {"ranking": 0, "story_id": "8147892", "time": "2014-08-07T22:57:49", "id": "8148013", "query_class": null, "text": "Ahoy!

There are a lot of different use cases mentioned on the homepage. Which ones are the most prevalent by beta users?

I realize that this second question may be driven by the answer to the first, but are there plans to integrate with any existing list-making services (foursquare, evernote, etc.)?", "query": null, "by": "ILIKEPONIES"}, {"ranking": 0, "story_id": "8147892", "time": "2014-08-07T22:58:11", "id": "8148015", "query_class": null, "text": "We don't use iCloud for syncing, all the lists, nouns, broadcasts, and so on, are server-backed. The backend is primarily built on Rails server. Some services that run periodically are written in Go.", "query": null, "by": "mergesort"}, {"ranking": 0, "story_id": "8147892", "time": "2014-08-07T23:01:45", "id": "8148028", "query_class": null, "text": "I would say it's actually in the order that it is on the site. \nMaking lists were the top thing that everyone did, far and away, for personal use and for public display. Others liked having a central place to send recommendations from, for movies, restaurants, books, TV shows, podcasts, and more. The activity feed and broadcasts seem to be good when you have a lot of followers (as some early adopters did), so we expect that to grow over time.", "query": null, "by": "mergesort"}, {"ranking": 0, "story_id": "8206075", "time": "2014-08-21T13:55:22", "id": "8206079", "query_class": null, "text": "Swarovski origine en 1895, est le premier fabricant de cristal du monde, swarovski magasin de rabais de sortie vendre maintenant toutes sortes de produits, 2014 boutique en ligne de swarovski le plus xc3xa9levxc3xa9 d'actualisation de la France.\nhttp://www.769.fr/", "query": null, "by": "szhwatch"}, {"ranking": 0, "story_id": "8221215", "time": "2014-08-25T19:04:43", "id": "8221264", "query_class": null, "text": "What an absolutely worthless blogspam article. What did you exactly expect to happen by submitting it here?", "query": null, "by": "scrollaway"}, {"ranking": 1, "story_id": "8221215", "time": "2014-08-25T19:04:45", "id": "8221265", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "8221215", "time": "2014-08-25T19:08:02", "id": "8221275", "query_class": null, "text": "I don't think it should be considered as blogspam. The author has a point, the Linux desktop is not a success, especially among "non technical" users. However, I don't agree with his conclusion, I think it can change through the convergence strategy between the mobile and desktop Linux variants.", "query": null, "by": "moystard"}, {"ranking": 0, "story_id": "8221215", "time": "2014-08-25T19:19:40", "id": "8221293", "query_class": null, "text": "First paragraph:

> Linus Torvalds wants the Linux desktop. Too bad no one else does. This is never going to get any better, so let's give it up.

... What?

> No one outside geeky events like LinuxCon pines for the Linux desktop anymore.

What the F?

Article written by "Matt Asay", previous COO at Canonical. What a piece of trash this can be.

Of course the Linux desktop is not a success amongst non-techies. But that doesn't mean squat. Us techies have a very, very different market share regarding Linux. I am in the same situation as hundreds of other devs I personally know: I develop on Linux and I simply cannot develop on any other OS. If I were to switch to OSX or Windows (which I have attempted in the past), I would be slow, I would be inefficient, I would not enjoy programming as much and I would be frustrated all day to the point I'd simply not do anything productive.

So screw that. If the "Linux desktop" were to disappear, it's safe to say an immense amount of companies would temporarily be brought to a stall due to the amount of devs in my situation.

I'm also a DE developer. I don't work on the linux desktop for those theoretical "I hate Linux I don't want it" users the article mentions. I work on it for myself and people in my situation. Funny thing though, with proper UX, that overlaps with the theoretical users/grandmas/etc.

Will it be successful in the future? Maybe, maybe not. But having a libre OS, with a libre application suite is extremely important and it is just as important that people keep working on it.

It's easy to see how Canonical has become such a trashy company with people like the author previously at their helm.", "query": null, "by": "scrollaway"}, {"ranking": 1, "story_id": "8221215", "time": "2014-08-25T19:28:24", "id": "8221311", "query_class": null, "text": "While I think the article is garbage, I can definitely agree that the desktop is a problem. We need more people using Linux that are willing to make applications easy to use. Unfortunately I worked with GTK a bit this weekend and wow is that a painful experience.

I'm trying to find the video but unfortunately I can't right now. Either way, Linus made an excellent point in that the tools to make an excellent Linux desktop hadn't yet been developed until very recently and I'd agree with this. And with that said I'd say now is a better time than ever for some real advances in the desktop arena. Look at Elementary OS. I don't use it myself (Arch) but it does look quite nice and easy to use.

On a another note I have plenty of non-technical friends all operating on Ubuntu. May not be the best distro to put someone on according to the FSF but you must admit that Ubuntu has brought things a long way.

On boot they notice the Unity interface and say "Oh, it's like a phone". (Unity App bar)", "query": null, "by": "mattkrea"}, {"ranking": 2, "story_id": "8221215", "time": "2014-08-25T19:37:31", "id": "8221334", "query_class": null, "text": "He really doesn't have even a point. Stop thinking about? Move on? To where?

It may not be reality yet, but Linux on the desktop is happening. I see people trying it out, deploying it. There are actual (nontechnical) human beings trying out distributions. And if it's not reality yet, there's thousands of enthusiastic hackers trying to change the reality.

There's no strategy, it cannot be set, and it's not even needed. Besides, Android isn't in any way ideal development direction. It's crippled open source system. Also it's handicapped. It has a java syndrome.", "query": null, "by": "cheery"}, {"ranking": 0, "story_id": "8248659", "time": "2014-08-31T15:37:54", "id": "8248698", "query_class": null, "text": "Reducing the accuracy of the location might be helpful. I would never put my address / exact location into CL. Don't really need people casing my joint for laptops, etc.

Other than that it looks awesome...

Also, ditch the twitter stuff, my twitter contacts are worldwide, and probably not interested in what I have to sell on CL. Or at least explain why you need twitter, I clicked Don't Allow and then had to login manually anyway...

Works well on iOS 8,crashes when I tap the ... on my listing. (I know, it's a pain to support betas)", "query": null, "by": "fleitz"}, {"ranking": 1, "story_id": "8252120", "time": "2014-09-01T17:55:11", "id": "8252163", "query_class": null, "text": "FYI, whoishiring threads are only supposed to be started by the automated whoishiring thread bot.", "query": null, "by": "argonaut"}, {"ranking": 0, "story_id": "8252120", "time": "2014-09-01T17:57:03", "id": "8252170", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 2, "story_id": "8258117", "time": "2014-09-02T23:38:13", "id": "8258155", "query_class": null, "text": "My hunch is the people submitting these stories assumes that A) the name speaks for itself and B) they're trying to evoke some sense of wonder/excitement with the single-word title.", "query": null, "by": "bradhe"}, {"ranking": 0, "story_id": "8258117", "time": "2014-09-02T23:40:42", "id": "8258178", "query_class": null, "text": "It's not just the word "Drawbridge"; it's "Drawbridge (microsoft.com)". If you look through the announcements, you'll see dozens and dozens of new projects announced the same way.", "query": null, "by": "tptacek"}, {"ranking": 5, "story_id": "8258117", "time": "2014-09-02T23:41:34", "id": "8258179", "query_class": null, "text": "It may have to do with the time of the day. I would assume most mods are on Pacific time, and those stories were posted pretty early.", "query": null, "by": "diego"}, {"ranking": 4, "story_id": "8258117", "time": "2014-09-02T23:42:40", "id": "8258191", "query_class": null, "text": "Oftentimes I see one-word titles for companies that we already know of. For example, Drawbridge on Microsoft.com is most likely a new product from Microsoft and it's just as easy to clickthrough and read about it than try to decipher from an HN title. However, Mailvelope is not a company I've heard of and would have benefited from a description (however.. it was still easy to clickthrough).", "query": null, "by": "jonathanjaeger"}, {"ranking": 3, "story_id": "8258117", "time": "2014-09-02T23:42:40", "id": "8258192", "query_class": null, "text": "The HN guidelines[0] ask you to (almost always) use the title from the original page. Those titles follow the guidelines to the letter.

It's arguable whether that's a good guideline or not -- it keeps out a lot of editorializing from the titles, which is fantastic, but it does mean that the submissions frequently lack context.", "query": null, "by": "bkirwi"}, {"ranking": 1, "story_id": "8258117", "time": "2014-09-02T23:43:29", "id": "8258197", "query_class": null, "text": "Or hide it's irrelevance? "Drawbridge: In-process visualization of Win32 Binaries" will get a lot less clicks.", "query": null, "by": "smlacy"}, {"ranking": 6, "story_id": "8258117", "time": "2014-09-02T23:43:41", "id": "8258199", "query_class": null, "text": "The guideline is that submission titles should be the same as the title of the linked document. Which is true in this case.", "query": null, "by": "teach"}, {"ranking": 0, "story_id": "8258117", "time": "2014-09-02T23:44:18", "id": "8258206", "query_class": null, "text": "I'll take lack of context over editorializing any day.", "query": null, "by": "teach"}, {"ranking": 0, "story_id": "8258117", "time": "2014-09-02T23:46:24", "id": "8258220", "query_class": null, "text": "Well, if they didn't assume that the name speaks for itself, they'd make it more likely for people that don't know the products to discover that they exist... what is the entire point of an anouncement.

And now I'm remembering Dr. Strangelove for some reason.", "query": null, "by": "marcosdumay"}, {"ranking": 1, "story_id": "8258117", "time": "2014-09-03T02:27:04", "id": "8259252", "query_class": null, "text": "This post was killed by user flags.", "query": null, "by": "dang"}, {"ranking": 12, "story_id": "8394054", "time": "2014-10-01T21:05:27", "id": "8394055", "query_class": null, "text": "Clay.io - http://clay.io - San Francisco, CA

Hiring Full-Stack Engineers. Shoot me an email: austin@clay.io

  ===================\n  What we're building\n  ===================\n
\nWe're building Steam for casual mobile games - competing with the app stores to provide a better way to discover games on mobile.
The approach we're taking focuses on mobile web games - games people can access immediately without the added friction of installing them in an app store.

  ==============\n  Where we're at\n  ==============\n
\nSmall team of 3, with large audience of 4,000,000+ users to push code to. https://github.com/claydotio/clay-mobile for general idea of the quality of code we write.
  =========\n  Our Stack\n  =========\n
\nNode.js, CoffeeScript, Docker, Mithril.js, Gulp, Ansible, MongoDB, MySQL, ...", "query": null, "by": "austinhallock"}, {"ranking": 11, "story_id": "8394054", "time": "2014-10-01T21:06:37", "id": "8394060", "query_class": null, "text": "Twitter - Software Engineer - San Francisco, CA
My team is Observability at Twitter; we work on monitoring and wexe2x80x99re looking for distributed systems engineers and full-stack engineers. We are one of the largest monitoring stacks in the industry, writing up to 15 million metrics per second for all production services at Twitter. We also have a front-end service that is used every day by most engineers at Twitter. We write our services in Scala, use a state-of-art Cassandra-like database called Manhattan, and if you join, youxe2x80x99ll get to work on challenging problems from day one.

Here are some of the things wexe2x80x99ve done in the past 12 months:\n - Made our alerting execution service seamlessly fail over across datacenters\n - Implemented a temporal set membership service for our database to keep track of metric groupings\n - Added tiering policies for metrics based on their automatically-derived significance\n - Added hybrid online/offline processing of data for different use cases\n - Optimized the time-series query language to make reads more efficient\n - Made an asynchronous query processor to support expensive queries with lower latency requirements\n - Wrote a client-side agent that collects and reports metrics to the storage system

Our team is 12 people, including back-end, front-end, full-stack and reliability engineers. You can find out more by reading last yearxe2x80x99s article here: https://blog.twitter.com/2013/observability-at-twitter. More formal list of requirements for the position is here: https://about.twitter.com/careers/positions?jvi=oO0WXfwr,Job.

Engineers from foreign countries, H-1B initiations and transfers are welcome. You can reach out to me directly at ak@twitter.com and I guarantee a quick reply.", "query": null, "by": "alex_y"}, {"ranking": 18, "story_id": "8394054", "time": "2014-10-01T21:06:39", "id": "8394061", "query_class": null, "text": "Linkable Networks - http://www.linkablenetworks.com - Boston, MA (office is in Fort Point Channel

Company Summary

Linkable Networks is a digital media company that bridges the gap between consumer purchases and advertising by enabling brands to link product discounts and special offers directly to consumersxe2x80x99 existing credit/debit cards via Linkable Networksxe2x80x99 gateway to financial institutions.

Off-line sales still make up over 90% of retail business in the U.S. We're using our integrations into the transaction rails of the three largest card networks to complete the chain of attribution from offer presentment to brick-and-mortar purchase.

Technology Stack

Core Stack : { Java, Spring, Sharded mySql, Terracotta, RabbitMQ }\nMobile : { iOS, Android }

Additional Info

We're wired into the three largest card networks: Visa, Mastercard and Amex. We have a broad range of customers from grocery giant SuperValu where we're deployed with a first of its kind card-linked SKU offer solution to FanBank where we help enable community based Loyalty programs.

We run an agile shop with 64 successful sprints under our belts. Our process has been improved over the 4 years we've been running it so that we deliver on time and without drama. Our engineers don't sit in meetings they build solutions.

We're looking for solid Java engineers to join our team and help us build out the next level of capabilities on our platform.

If this sounds interesting, please shoot me an email at coolgigs@linkablenetworks.com", "query": null, "by": "fortpoint"}, {"ranking": 20, "story_id": "8394054", "time": "2014-10-01T21:18:58", "id": "8394110", "query_class": null, "text": "Code Club -- Head of Engineering -- London, UK

https://www.codeclub.org.uk/jobs/head-of-engineering

Code Club is a network of over 2000 after-school coding clubs for children. We've created some great tools that help us recruit, support and manage volunteers and now we want to expand on those and share them with the world to help grow the number of Code Clubs outside of the UK.", "query": null, "by": "CodeClubRik"}, {"ranking": 6, "story_id": "8394054", "time": "2014-10-01T21:24:40", "id": "8394134", "query_class": null, "text": "Epoxy (http://epoxy.tv) in Venice, CA (Los Angeles; full time, remote considered; H-1B transfers)

     Build the future of online video!\n\n     Node.js + Express / Ruby + Rails / MongoDB / Redis / Chef / AWS & friends\n\n     Solve real problems around scale, efficiency, data and rich consumer UIs\n\n     Top VC backing, freshly closed Series A\n
\nJoin our exceptional engineering and product design team and help define the future of online video. Wexe2x80x99re at the unique point in a startupxe2x80x99s life where we have the stability of a fresh round of capital, a live product, and ramping sales. We have about as much stability as a startup can yet wexe2x80x99re still at a point where each teammate has a massive impact on the product and company. If any of this sounds up your alley, we'd love to connect. At the top of our list are:
Senior full-stack product engineers: http://epoxy.tv/careers/rails

Data engineers: http://epoxy.tv/careers/data

DevOps: http://epoxy.tv/careers/devops

A bit about us:

Epoxy builds exceptional software for online video creators and viewers. Our tools help YouTubers and networks optimize their businesses and deepen the relationship with their audience. Our channel experiences provide viewers with new ways to connect with and experience the content they love.

Epoxy was founded by designers, engineers and entrepreneurs who are passionate about product and solving problems. Our backgrounds include Stanford, Brown, IDEO, Adobe, Mixpanel, Google/YouTube and Team Downey.

Sound interesting? Check out more complete descriptions at http://epoxy.tv/careers or drop us a line at jobs@epoxy.tv. Thanks!", "query": null, "by": "jaymod"}, {"ranking": 3, "story_id": "8394054", "time": "2014-10-01T21:34:06", "id": "8394178", "query_class": null, "text": "Alphalend (www.alphalend.com) - London - First non-founding developer(s)

=== TL;DR ===

We believe that banking should be driven by the latest and greatest technologies, not legacy systems. As technology evolves, banking processes should evolve in sync, not lag behind. That is our goal here at Alphalend: to supercharge consumer lending and revolutionise the industryxe2x80x99s standard practice . Technology moves fastxe2x80xa6 nothing you read below is set in stone and everyone who joins our team is expected to continually drive us to do better. If this sounds like you, please get in touch: contact@alphalend.com

=== Who are we? ===

We are a small, passionate and energetic team of exceptional people funded by some of Europexe2x80x99s most respected angel investors. Our vision is to move banking into the 21st century. We have the plan, the backing and the skills to make it happen but we need additional talented devs to push us further and faster.

=== Who are you? ===

You are a leader: you imagine, share, collaborate and create. You have the skills and experience to improve and evolve our development strategy, but most of all you always want to keep learning. You relish the idea of joining a fast-growing company that is using cutting edge technology to redefine the world of retail banking. An understanding of IoC, its benefits and drawbacks, quality testing and experience working in early stage teams are the key skills required given our current setup. Our technology stack will evolve, however, so you should love to experiment, always striving to find the best means to achieve the goal at hand, and always be keen to explore new technologies that would improve our product.

=== What we offer: ===

Market-leading compensation

25 days holiday + public holidays

Whatever equipment you need to get the job done - you choose

Flexible working hours whenever possible. Occasional working from home

7th floor office with the best view of any office youxe2x80x99ve worked in, guaranteed

Opportunity to be our first non founding developer, take a key role in recruiting the team and evolving our development strategy

=== Technology: ===

Platform built on Symfony 2.4

Doctrine2 using MySQL on Amazon RDS. Doctrine migrations for DB updates.

PHP5.5 and Apache running on Amazon EC2

Testing with PHPUnit. Coverage currently around 30%, ideally you can help improve this. BDD lover? Please teach me!

Jenkins used for automated build and deployment

Git for version control

Lots of 3rd party APIs used to gather data (REST and SOAP)

Machine learning (fuzzy logic and neural networks) for the most intelligent risk assessment and pricing possible.

Extensive analytics driven marketing.

No legacy code, all written in the last 6 months

=== How we work: ===

Our development methodology is currently very agile and approaches continuous deployment. We regularly do several live deployments per day. A feature implementation would go something like:\nFeature branch -> implement -> code review -> merge to development -> test on dev -> merge to master -> deploy to live.

=== Interested? ===

email us at contact@alphalend.com", "query": null, "by": "jamespayneuk"}, {"ranking": 17, "story_id": "8394054", "time": "2014-10-01T21:38:18", "id": "8394197", "query_class": null, "text": "Coolblue - Rotterdam, NL - Full-time C# Developers of all levels (relocation offered) - http://goo.gl/yeVZKi

Hiring awesome developers.

We are in the process of a monstrous migration to C#. The application concerned is Vanessa, and Vanessa is big and complicated. We are not just migrating it, wexe2x80x99re building a completely new C# CRM meets ERP application from scratch. So no legacy code in our C# ;-). To do such a job in a very good way very very very intelligent developers are key.

Coolblue is: no hierarchy, crazy obsession for testable code, max intellectual freedom, growing ridiculously fast, loads of fun (we have our own gaming arcade and bar) and not to forget great technical expertise!

We're doing good, very good: we're an awardwinning company and we've set the standard for e-commerce in the Netherlands.

To be able to stay the best, we need the best. That's why I'm posting.

Wanna know more? http://goo.gl/yeVZKi

Hunger not satisfied? b.bloemsaat@coolblue.nl", "query": null, "by": "bbloemsaat"}, {"ranking": 0, "story_id": "8394054", "time": "2014-10-01T21:44:27", "id": "8394223", "query_class": null, "text": "Sounds like fun. I wonder though what 'intellectual freedom' means? It can't, for instance, mean 'disagree with the premise that testable code is the highest good' for instance.", "query": null, "by": "JoeAltmaier"}, {"ranking": 0, "story_id": "8394054", "time": "2014-10-01T21:54:22", "id": "8394281", "query_class": null, "text": "Hi Joe,

We're always in for a good discussion (and even better: good arguments)on the reasons why we do what we do. How do we serve our long term goals best? That's the question we'd like to answer.", "query": null, "by": "bbloemsaat"}, {"ranking": 14, "story_id": "8394054", "time": "2014-10-01T22:00:06", "id": "8394313", "query_class": null, "text": "Tictail - Software Engineers - New York, NY (full time, no remote, no visas sorry)

We are in the early stages of establishing the Tictail growth team in New York. Growth is one of the most dynamic, creative and interesting areas to work on as an engineer if you are interested in product design and what makes startups succeed. Like everything, it can be used for good and evil. So if you are excited about the thought of helping hundreds of thousands of small businesses across the globe succeed through your product, engineering and data skills, we should talk.

Our stack is mostly Python and Javascript.

Read more and apply: http://tic.tl/1wXXnhm

or email me: martin+hn (a) tictail.com", "query": null, "by": "mmelin"}, {"ranking": 0, "story_id": "8394054", "time": "2014-10-01T22:00:56", "id": "8394318", "query_class": null, "text": "Good answer. I'm not criticizing testability, but passion and intellectual freedom just seemed at odds to me.

A better discussion would be, how did the language and tools get chosen? Is it a drive for some uniformity only? Different tools are good for different purposes of course, and I'm guessing in your solution there are different problem domains, not all served by a single choice of tool.

A good question to ask during the interview I guess.

Good luck with your new direction!", "query": null, "by": "JoeAltmaier"}, {"ranking": 21, "story_id": "8394054", "time": "2014-10-01T22:01:35", "id": "8394324", "query_class": null, "text": "MeetMe - New Hope, PA (near Philadelphia, Pennsylvania) - http://www.meetme.com/apps/careers

See all public openings here: http://jobvite.com/m?3SzvEgwl

About Us: MeetMe is the leading social network for meeting new people in the US with over 1 million DAU. We've been around since 2005 as myYearbook, rebranding in 2012 as MeetMe. We've launched other apps such as Focal, Choosy, Charm, and Unsaid in the past, and are looking to continue adding more standalone apps in the future.

We use a wide variety of languages, generally using what makes sense. C, PHP, Python, JavaScript and Node.js, and native iOS and Android development are the most common.\nMeetMe is a fun place to work. We hold a yearly developer retreat, as well as regular company-wide hackathons. We have a book club, board game club, and we even have a game room. And our summer hours last all year round.

While we aren't a new company in the time scale of the internet, we still know how to have fun. We just get the benefit of not having to kill ourselves working 12 hour days. =) This means you'll enjoy actually going home on time! We have many openings, both technical and non-technical. Here is a list of positions we are usually always looking for.

* Senior Android Developer

* Software iOS Developer

* Network Engineer

You can apply directly here: http://jobvite.com/m?3SzvEgwl

Or you can contact me at jlotito@meetme.com. I'm a developer, so feel free to ask specific developer-type questions.

You can also check out our Engineering blog here: http://engineering.meetme.com", "query": null, "by": "jasonlotito"}, {"ranking": 0, "story_id": "8394054", "time": "2014-10-01T22:03:40", "id": "8394345", "query_class": null, "text": "H1/O1 visas?", "query": null, "by": "Intimatik"}, {"ranking": 13, "story_id": "8394054", "time": "2014-10-01T22:05:15", "id": "8394366", "query_class": null, "text": "Vimeo - NY, NY

https://vimeo.com/jobs

2013: The Year We Did More Cool Stuff - https://vimeo.com/82576921

TECHNICAL:

- Sr. Engineer, iOS

- Sr. Engineer, Internal Tools (HTML, JavaScript, PHP)

- Director, Data Engineering (Hadoop, Vertica)

- Director, Product Management - Mobile Apps

- Product Manager, Connected TVs

- Lead Designer, Web

- QA Manager, Functional Testing

- Associate Engineer, Entry-Level

NON-TECH:

- Manager, Web Analytics

- Sr. Associate, PR

- Copywriter

- Associate, Display Media Marketing

Stuff we use: PHP, Python, MySQL, Mongo, Redis, AWS, Solr, Hadoop, nginx, node, Vertica. And pretty much any mobile platform.

Feel free to reach out: tyler at vimeo dot com.", "query": null, "by": "vimeojobs"}, {"ranking": 2, "story_id": "8394054", "time": "2014-10-01T22:05:24", "id": "8394369", "query_class": null, "text": "Front Row Education (https://www.frontrowed.com/) - San Francisco, Fulltime

== Position ==

Early Full-stack web engineer to join fast-growing education startup that changes how hundreds of thousands of kids learn math. Email jobs@frontrowed.com

== TL;DR - Reasons to care about working with Front Row ==

- A mission you can be proud of: kids using Front Row improve twice as much at math\n- Tremendous impact on a small team\n- Flexibility on what you work on, and autonomy over your schedule\n- Effective & exciting tools: Clojure, Haskell, PostgreSQL, Backbone.js, Ansible\n- Be part of a growing success: in just over a year after launch, we are in more than 6% of all US schools

== The Business ==

Millions of teachers around the USA are struggling to help 30+ students in their class learn math because every student is in their own place. In a typical fourth grade classroom, there may be students learning to count, students learning to add, students learning to multiply, and students learning how exponents work - and one teacher somehow needs to address all these needs.

Thousands of teachers use Front Row every day to save hours of time and make sure their students are growing quickly. Front Row active users have been growing 100% a month for the past 8 school months.

== The Role ==

As one of our very first engineers, you will be part of a team of developers who are passionate about their vocation, take pride in their craft and who push each other to grow as professionals. You will strive for pragmatism and 80/20 in your work. You will be using tools that provide you with the most leverage and make you most effective. By working really smart, you will produce more than the average developer ever will, but without the crazy hours.

You will work in an effective team that plans, executes and reflects together. Because wexe2x80x99re a small team, everything you create will go into production and be used by students. You will never do unimportant work: every contribution will make a clear and tangible impact on the companyxe2x80x99s trajectory. Your personal success will be directly aligned with that of the company.

Most importantly, your work will have purpose: Front Row is a mission-driven company that takes pride in making a significant impact in the lives of hundreds of thousands of students.

== Benefits ==

- Competitive salary\n- Generous equity option grants\n- Medical, Dental, and Vision\n- Food budget\n- Work from home up to 1 day a week, extremely flexible work schedule\n- Team meal outing every week, and half-day event every month (trip to Sonoma, BBQ, etc)\n- Equipment budget\n- Flexible, untracked vacation day policy\n- Working from Runway - one of the best startup coworking locations right in the heart of San Francisco

Email jobs@frontrowed.com to tell us a bit about yourself if you would like to apply.", "query": null, "by": "sikakkar"}, {"ranking": 8, "story_id": "8394054", "time": "2014-10-01T22:05:41", "id": "8394371", "query_class": null, "text": "OpenSignal - London, UK (Full time, permanent)

At OpenSignal we're using mobile apps to tap into the smart phones we're all carrying around with us to build up global crowdsourced sensor networks. Our first sensor network is for wireless signal [1] where we are building a global database on the coverage and performance of wireless networks (both mobile + WiFi) on a scale that has never before been possible. Our second sensor network is WeatherSignal [2], which uses the barometers, thermometers and hygrometers on smart phones to crowdsource weather data and we have already published a scientific paper [3] showing the potential of this approach. If the concept of crowdsourced sensor networks appeals to you too then please get in touch. We are hiring for all manner of different roles right not (backend, frontend, UX/UI & data science) but most of all we are just looking for smart, like minded people rather than people with specific, existing skills.

More info: http://opensignal.com/jobs/ \nEmail us: join@opensignal.com

[1] OpenSignal App: https://play.google.com/store/apps/details?id=com.staircase3... \n[2] WeatherSignal App: https://play.google.com/store/apps/details?id=com.opensignal...\n[3] Battery Temperature/Weather correlation: http://opensignal.com/reports/battery-temperature-weather/", "query": null, "by": "brendan_gill"}, {"ranking": 16, "story_id": "8394054", "time": "2014-10-01T22:07:09", "id": "8394378", "query_class": null, "text": "SeatGeek xe2x80x94 New York, NY xe2x80x94 Full Time xe2x80x94 We're a search engine for tickets and live events.

Web Engineer xe2x80x94 We're looking for someone who loves building for the web. Everything else (professional experience, where in the stack you fit, the languages you've used) is up for grabs. Details here: http://seatgeek.com/jobs/web_engineer/", "query": null, "by": "jack7890"}, {"ranking": 7, "story_id": "8394054", "time": "2014-10-01T22:10:05", "id": "8394395", "query_class": null, "text": "Backend Ruby Developer / Data Geek - Charlie - Chicago, IL

Before any meeting, Charlie automatically researches the people youxe2x80x99re about to meet. Researching people is a complex problem: we sift through, analyze, and manipulate data into powerful insights (i.e. what are they passionate about, what do you have in common?). Wexe2x80x99re a VC-backed startup and growing like crazy.

Wexe2x80x99ve built Charlie on Ruby on Rails, MongoDB, Redis, Sidekiq, RSpec, Capybara, and it lives on an elastic server farm. We iterate fast, practice continuous delivery, process-driven, and very test-focused.

Wexe2x80x99re looking for a backend Ruby developer who wants to make an impact in a growing startup. If this sounds like you, drop us a line and letxe2x80x99s talk! jobs+hn@charlieapp.com

Why wexe2x80x99re special:

* Take as much vacation as you need.

* Flexible working situation: hours, location

* Competitive salary + equity

* VC-backed, funded startup

* Everyone deploys to production (fully automated, painless)

* Free coffee, free beer (after youxe2x80x99ve had your coffee)

* We go out and do fun things (concerts, Bulls & Cubs games, and occasionally ski in Colorado)

Requirements:

* Back-end developer, front-end is a plus

* Ruby on Rails preferred, but you can learn.

* DB experience (SQL or NoSQL?)

* Not afraid of the front-end (HTML5, jQuery, Coffeescript, bootstrap, Sass, Slim)

* Test your code (Rspec, capybara, cucumber, etc)

* Hobbyist: Working on a side project to learn new technology?

* Creative problem solver

* Git / Github

* Smart & gets things done.

Chicago, IL

Apply\nInterested? Hollar at us. email jobs+hn@charlieapp.com.

https://charlieapp.com/jobs", "query": null, "by": "robvolk"}, {"ranking": 1, "story_id": "8394054", "time": "2014-10-01T22:10:59", "id": "8394405", "query_class": null, "text": "ShareLaTeX - UK, full-time, remote, first non-founder developer.

Help us empower scientists by building usable research tools.

Wexe2x80x99re looking for a full stack web developer to join us as employee number 1 at ShareLaTeX (www.sharelatex.com). Our flagship product is an online LaTeX editor that makes it trivial to get started with LaTeX and collaborate with your colleagues. Students and scientists love us, and now wexe2x80x99re looking to expand our team so that we can solve similar workflow problems in data analysis and numerical modelling (using Python and R).

You should be comfortable quickly learning new technologies and enthusiastic about improving the efficiency of scientists and their tools. Our current technology stack involves Node.js, MongoDB, Redis, Coffeescript, Angular.js, and Docker, so experience in these is useful but not required. Wexe2x80x99d rather see that you have demonstrable interest in the problems we are solving, and that youxe2x80x99ve created some great stuff in the past.

Some reasons you'd enjoy working for us:

* Around 80% of our codebase is open-source and wexe2x80x99re big fans of free software.

* Wexe2x80x99re agile (with a lower case a). We test everything (unit and acceptance), we have a CI build process, a full staging environment to play with, and we automate as much as possible.

* We donxe2x80x99t expect you to have to fill up a 9-5, 40 hour work week. A work/life balance is important and we donxe2x80x99t think programming is an activity that can be neatly time boxed.

* You can work fully remotely (in fact, you probably will). The founders work remotely already.

* Wexe2x80x99re a bootstrapped company with no outside investors.

Send me an email: james@sharelatex.com", "query": null, "by": "jpallen"}, {"ranking": 15, "story_id": "8394054", "time": "2014-10-01T22:11:20", "id": "8394406", "query_class": null, "text": "miDrive (http://www.miDrive.com) - London, Full Time

Write to me: scott.taylor@midrive.com

=== Position ===

Javascript / Mobile Developer

=== About miDrive ===\nHave you got what it takes to join our small and hand-picked team of talented individuals, working for a fast-paced tech startup as a Javascript Developer?

miDrivexe2x80x99s mission is to reinvent learner driving with technology, and, with our online marketplace and apps for iOS and Android, wexe2x80x99re well on our way to changing the way people learn to drive forever.

From our office on the Kent coast, our small team have built a community of driving instructors, have developed and launched two awesome apps and are engaging with a community of over 15,000 learner drivers each and every day.

Wexe2x80x99re not stopping there though. We believe miDrive has the potential to change the way people learn to drive all over the world, and our next stop is Europe.

=== You Should Have ===

Real-world experience of Backbone.js (any knowledge of other JS MVC frameworks is a plus)

Good working knowledge of development and debugging with Chrome dev tools

Knowledge of the pitfalls and workarounds of building hybrid mobile apps

Dogged determination to create the best app possible within the constraints of a start-up environment

=== You Should Be Willing to Learn ===

How to build hybrid apps with Cordova

New emerging frameworks (eg famo.us or similar) that improve performance of hybrid mobile apps

Best practices for js app testing

How to work in a weekly sprint-based workflow", "query": null, "by": "scotthtaylor"}, {"ranking": 5, "story_id": "8394054", "time": "2014-10-01T22:12:58", "id": "8394412", "query_class": null, "text": "WePay.com - Palo Alto, CA - Full-time (Relocation assistance provided)

WePay is looking for talented and motivated software engineers to join our rapidly expanding team. Our transaction volume has more than tripled year-over-year, and we need your help to scale our customersxe2x80x99 payments to even higher levels over the next few years. We are eager to grow our team of engineers who love programming, take pride in the quality of their code, and are at least decent at ping pong (rock climbing is a nice-to-have).

Requirements:

You must be a great coder that loves to write efficient and maintainable code. We believe that great coders can adapt to whichever new language they need to, whether itxe2x80x99s Java, Python, PHP, Javascript, C++, Scala, Ruby, or any other SEO-optimized buzzword, so we donxe2x80x99t care what background you have (unless you have solely coded in brainfxck). And in fact, we have outgrown our current PHP-MySQL environment and are in the process of architecting our next-generation service-oriented architecture, so we will be excited to make full use of your experience and perspectives as we select the right tools for the job.

You must be able to take complete ownership over a bug, feature, or entire project and drive it to completion. We have to trust that each of our team members can work in relative independence because we hate micro-managing.

You must be open-minded, flexible, and have a pragmatic approach to solving problems. The payments industry can be baffling at times, so we value people who can persevere and continue to make progress with a positive attitude.

One or more of the following specialized skills would be awesome:

* Front-end expertise, including JavaScript, CSS, AngularJS

* Back-end expertise, including extensive database experience

* High Availability and Distributed Systems

* Big Data experience, including Hadoop and/or Storm

* Machine Learning and Modelling

* Experience in Risk and Fraud Detection

* Experience in payments and PCI compliance

* Expertise in Security

* Team Lead experience

If you have any interest or questions about WePay, please contact me directly at steven at wepay.com. I'm an engineer, not a recruiter, so your email will get a response.", "query": null, "by": "stevewepay"}, {"ranking": 19, "story_id": "8394054", "time": "2014-10-01T22:13:45", "id": "8394417", "query_class": null, "text": "Digital Designer / Stickyeyes / Leeds UK

Stickyeyes are looking for a Digital Designer to help deliver on a wide range of digital experiences. The successful candidate will be working alongside our in-house team of designers, developers and creative leads, helping to take projects from brief to completion.

Wexe2x80x99re not looking for a run-of-the-mill mac monkey to churn out generic templates, wexe2x80x99re looking for an experienced designer that can contribute to concept discussions by bringing fresh ideas to the table, before creating designs that not only look great, but also address the challenge at hand.

Wexe2x80x99re looking for a perfectionist; someone who takes great pride in perfecting the smallest details of their designs and your portfolio must demonstrate a track record of delivering inspiring creative work.

If you're interested, email your CV and examples of work to Graham McDonnell at graham.mcdonnell@stickyeyes.com", "query": null, "by": "grahammcuk"}, {"ranking": 23, "story_id": "8394054", "time": "2014-10-01T22:13:50", "id": "8394419", "query_class": null, "text": "Digital Designer / Stickyeyes / Leeds UK

Stickyeyes are looking for a Digital Designer to help deliver on a wide range of digital experiences. The successful candidate will be working alongside our in-house team of designers, developers and creative leads, helping to take projects from brief to completion.

Wexe2x80x99re not looking for a run-of-the-mill mac monkey to churn out generic templates, wexe2x80x99re looking for an experienced designer that can contribute to concept discussions by bringing fresh ideas to the table, before creating designs that not only look great, but also address the challenge at hand.

Wexe2x80x99re looking for a perfectionist; someone who takes great pride in perfecting the smallest details of their designs and your portfolio must demonstrate a track record of delivering inspiring creative work.

If you're interested, email your CV and examples of work to Graham McDonnell at graham.mcdonnell@stickyeyes.com", "query": null, "by": "grahammcuk"}, {"ranking": 9, "story_id": "8394054", "time": "2014-10-01T22:15:26", "id": "8394431", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 22, "story_id": "8394054", "time": "2014-10-01T22:16:48", "id": "8394437", "query_class": null, "text": "Now Business Intelligence - Boston, MA - Full-Time

We're looking for:

* Software developers, specifically: Java, ASP.NET, and Web (JavaScript/HTML/CSS). You'll be working with: Knockout.js, Spring MVC, Oracle, and Team Foundation Server

* QA (testing engineers), with an emphasis on the Microsoft stack

* ETL/BI developers

* SharePoint administrators

* Business analysts

* And project managers

Who we are:

We're an information strategies and software solutions firm that provides a variety of solutions, from software to hardware. Most of our day-to-day resolves around service work for our clients (medium to very large in size), but we're also working on products of our own. Much of the latter happens in our Boston-based hacker-space, where we keep the 3D printers. In terms of culture, you'll find us manning booths at Rhode Island Comic Con and Granite Con, kung fu lessons on the roof of our shop, and the like. We're still small enough (around 30 total employees) that you can get to know most everyone in the company, including the owner/president and our crazy-smart developers.

You can find our full job listings here:

http://www.nowintelligence.com/careers/join/

Who I am:

I'm a senior software developer and a recent hire myself, with a specialization in web development. Right now, I work full-time at the office of one of our larger clients. There's a good chance that I'll interview you if you apply for a technical role, so feel free to contact me at my personal address: hn@thirdtruck.org.", "query": null, "by": "thirdtruck"}, {"ranking": 4, "story_id": "8394054", "time": "2014-10-01T22:18:06", "id": "8394449", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 10, "story_id": "8394054", "time": "2014-10-01T22:35:08", "id": "8394635", "query_class": null, "text": "TheLadders -- Software Engineer -- New York, NY

- What We're Looking for -

TheLadders (http://www.theladders.com) is looking for full-time lead software engineers with experience building backend systems using JVM technologies. You will be responsible for helping to set the technical direction of the team, mentor other engineers, and contribute to the design and development of our products. If you're interested, email me at aturley@theladders.com.

- What We Do -

Our mission at TheLadders is to help people advance their careers by providing access to information and intelligence about jobs, jobseekers, and their professional networks. From the user's perspective this is accomplished through our websites and mobile apps. Under the hood, we have a technical infrastructure that uses Java, Scala, RabbitMQ, Storm, Clustrix, Couchbase, and a variety other technologies to deliver useful information to our users.

- Who We Are -

Our engineering team is committed to growing and improving. We like to share things that we've learned on our developer blog (http://dev.theladders.com/), each engineer is given a yearly conference budget, and we have a weekly meeting called The Conclave where engineers share what they know and what they've learned in the last week. We also take care of our engineers, with unlimited vacation, comprehensive health insurance, and competitive compensation.", "query": null, "by": "aturley"}, {"ranking": 0, "story_id": "8394054", "time": "2014-10-02T02:31:24", "id": "8396669", "query_class": null, "text": "Only the whoishiring account is allowed to post these: https://news.ycombinator.com/newsfaq.html.

Accordingly, the current post was correctly killed by user flags.", "query": null, "by": "dang"}, {"ranking": 3, "story_id": "8420892", "time": "2014-10-07T22:20:51", "id": "8421262", "query_class": null, "text": "oof. I want my routing protocol back.", "query": null, "by": "pyvpx"}, {"ranking": 1, "story_id": "8420892", "time": "2014-10-07T22:31:07", "id": "8421335", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 4, "story_id": "8420892", "time": "2014-10-07T22:42:23", "id": "8421423", "query_class": null, "text": "i always thought "because they're crazy!" was a fishy explanation for hundreds of thousands of people fighting against foreign oppression.", "query": null, "by": "elbii"}, {"ranking": 0, "story_id": "8420892", "time": "2014-10-07T22:47:51", "id": "8421457", "query_class": null, "text": "The "foreign oppression" explanation is also pretty fishy. ISIS is clearly focussed on gaining money and power for it's leadership.", "query": null, "by": "wmil"}, {"ranking": 2, "story_id": "8420892", "time": "2014-10-07T22:52:01", "id": "8421478", "query_class": null, "text": "Nice to see an objective analysis of the situation and pulls out some good points. Western media's portrayal of many events in the Middle East our highly antagonistic and make a mockery of any idea of objective news coverage.

The lack of knowledge regarding the capabilities of ISIS is a very interesting detail. There is no way that a high functioning organisation, there is no denying that it is effective in terms of administration, military capability, diplomacy and propaganda, can just appear out of no where without some very capable individuals guiding the organisation. The burning question is where did they get these capabilities, it really does not just materialize out of some random assortment of uneducated militia men.", "query": null, "by": "Guthur"}, {"ranking": 0, "story_id": "8420892", "time": "2014-10-08T05:46:59", "id": "8424211", "query_class": null, "text": "This post was killed by user flags.", "query": null, "by": "dang"}, {"ranking": 0, "story_id": "8436875", "time": "2014-10-10T17:34:49", "id": "8436909", "query_class": null, "text": "At least Jony Ive is irritated. But we have to commit that Xiaomi did some micro-innovation in its MIUI.", "query": null, "by": "changshaman"}, {"ranking": 0, "story_id": "8448867", "time": "2014-10-13T23:20:27", "id": "8449028", "query_class": null, "text": "This site is incredibly ugly", "query": null, "by": "gherkin"}, {"ranking": 0, "story_id": "8449000", "time": "2014-10-13T23:29:43", "id": "8449077", "query_class": null, "text": "Doesn't work. "This app is in development mode and can't accept more users. Contact the app developer and ask them to use the Dropbox API App Console to apply for production status."", "query": null, "by": "mjohn"}, {"ranking": 0, "story_id": "8449000", "time": "2014-10-13T23:35:43", "id": "8449101", "query_class": null, "text": "Bummer.", "query": null, "by": "tlongren"}, {"ranking": 0, "story_id": "8449000", "time": "2014-10-13T23:46:52", "id": "8449167", "query_class": null, "text": "I tested it can work now.", "query": null, "by": "tdxAbc"}, {"ranking": 3, "story_id": "8449000", "time": "2014-10-14T01:37:30", "id": "8449663", "query_class": null, "text": "No example site?", "query": null, "by": "bluthru"}, {"ranking": 1, "story_id": "8449000", "time": "2014-10-14T02:00:36", "id": "8449757", "query_class": null, "text": "I'm apparently very bad at choosing site names or there's something wrong with that piece. Seems that no matter what I choose for a site name, I'm shown a message stating that I can't use that name.", "query": null, "by": "tlongren"}, {"ranking": 2, "story_id": "8449000", "time": "2014-10-14T02:16:34", "id": "8449827", "query_class": null, "text": "You should post up an FAQ or more information on how this works before asking users to login with their Dropbox account.", "query": null, "by": "photofriendly"}, {"ranking": 0, "story_id": "8449000", "time": "2014-10-14T03:18:51", "id": "8450094", "query_class": null, "text": "It's a pretty small scale project, here's a sample site: http://foliopanda.com/test_site", "query": null, "by": "taskstrike"}, {"ranking": 1, "story_id": "8449000", "time": "2014-10-14T03:28:49", "id": "8450136", "query_class": null, "text": "I think there is an error, I am getting the same thing, sorry if you check http://foliopanda.com/test_site this was working.", "query": null, "by": "taskstrike"}, {"ranking": 0, "story_id": "8449000", "time": "2014-10-18T21:15:15", "id": "8475265", "query_class": null, "text": "I'm getting the exact same "error", and if I enter a new one and click "Create", it doesn't show anything different (even the error message states the previous name), but if I click the link to add pictures, it just opens a new tab with the same page... I believe this is still an unfinished product. A little more info would be much appreciated.", "query": null, "by": "JohnQUnknown"}, {"ranking": 0, "story_id": "8501343", "time": "2014-10-24T08:17:37", "id": "8501468", "query_class": null, "text": "As a native english speaker the use of the "singular they/their" sounds correct and natural. This is also great bikeshed material.", "query": null, "by": "dmm"}, {"ranking": 5, "story_id": "8503022", "time": "2014-10-24T19:04:08", "id": "8503047", "query_class": null, "text": "As a systems programmer you really don't seem to understand what an operating system is. If you can compare MacOS and Linux in the same breath, and use largely different terms when both are POSIX Unix like OSes.

What you are looking for is a windows manager or theme, not an underlying OS. You seem to have those confused. MacOS, Andriod, Linux, and IOS fundamentally and at their core largely work exactly the same.

Actually at their core, Linux and Andriod are the same OS-- Linux.

So please. If you want to disrupt a market, learn how the market works.", "query": null, "by": "valarauca1"}, {"ranking": 7, "story_id": "8503022", "time": "2014-10-24T19:04:56", "id": "8503051", "query_class": null, "text": "start reading about the burroughs B5000 and go forward in time from there to see where things went wrong", "query": null, "by": "gjvc"}, {"ranking": 8, "story_id": "8503022", "time": "2014-10-24T19:06:04", "id": "8503052", "query_class": null, "text": "bsd", "query": null, "by": "abcdabcd"}, {"ranking": 6, "story_id": "8503022", "time": "2014-10-24T19:06:13", "id": "8503053", "query_class": null, "text": "too basic, not simple

What does this mean?", "query": null, "by": "pjc50"}, {"ranking": 1, "story_id": "8503022", "time": "2014-10-24T19:06:19", "id": "8503054", "query_class": null, "text": ">I can't define exactly the problem within the minutes I'm writing this and probably I don't have the knowledge to do it but I can feel that lots of stuff are wrong.

>While this problem is not solved I don't think we can dive into the future.

>There's a huge market waiting. Something must be made.

Or maybe, just maybe, you have no idea what you're talking about, as you almost admitted yourself.

>I challenge HN community to disrupt operating systems.

I hereby challenge you to do it yourself. No offense intended.", "query": null, "by": "tux3"}, {"ranking": 2, "story_id": "8503022", "time": "2014-10-24T19:09:56", "id": "8503064", "query_class": null, "text": "> Windows and OSX are bloated; Linux is raw, not simple; IOS seems too basic, not simple; Android seems a piece of junk based on obsolete technologies.

Users don't care tech behind the scene, bloated or perfectly written code. If the software is fulfilling the use case or not is the only things the users care. IMO, the market should be determined based on use case not based on how any software is written.

If you come up with completely revolutionary idea of how a typical user should interact with computer, then probably you can enter into OS market, otherwise it is very very tough market to enter.", "query": null, "by": "rajeevk"}, {"ranking": 0, "story_id": "8503022", "time": "2014-10-24T19:13:39", "id": "8503075", "query_class": null, "text": "Each of the major operating systems on the market today is generally incredibly well designed and fit for its purpose.

It is the purpose that needs changing.

The next operating system I will use will allow me to log in from any terminal anywhere in the world and receive the same experience. The OS will be a simple abstraction layer over my individual data, preferences and even personal UX. It won't matter if I'm looking at a phone or a tablet or a television or my refrigerator, the interface will be tailored to my context and all the same data will be accessible.

Many would argue thnt the web is this OS, and they would be right in many respects. But the main desktop and mobile and refrigerator experiences are still vastly separated; the next OS will remove this separation, as it no longer provides us with any advantage in the great majority of cases.

OS wise, this would bring many challenges. How do you securely sync data, and more importantly, code? Where does a user and their data live when not logged in? How is all the data transfer handled in an efficient way? What lives on each device versus on a server somewhere? How can a user continue to own their data and devices, rather than having them appear amorphous and distant? How do you keep a universal and omnipresent feel without sacrificing the power of using native hardware and capabilities?

Certain cloud services have come far in this area, but none have been ambitious enough to tackle the whole experience.

Do that right, and the world will be yours.", "query": null, "by": "calinet6"}, {"ranking": 4, "story_id": "8503022", "time": "2014-10-24T19:18:35", "id": "8503091", "query_class": null, "text": "OS' are more resistant to changes because of the effort involved in re-training. In purely consumer space, we already have iOS and android which do offer a more modern approach to human-computer interaction than desktop OS'. The world is simply not ready for anything disruptive in this space. Take WinFS for example.. too early for adoption.

One step in the right direction is ChromeOS (and firefox OS to some degree), and its model IS going to be the future, but the problem with ChromeOS are: (a) web technologies are not mature yet, (b) any new OS should have support for both native and web apps.", "query": null, "by": "jitix"}, {"ranking": 1, "story_id": "8503022", "time": "2014-10-24T19:44:25", "id": "8503158", "query_class": null, "text": "To really disrupt anything vision comes first. Think about google, facebook, amazon, spaceX, etc.

Then, to optimize, learn how the market works.", "query": null, "by": "galfarragem"}, {"ranking": 0, "story_id": "8503022", "time": "2014-10-24T19:45:31", "id": "8503162", "query_class": null, "text": "He's an end user, not a programmer. He doesn't care about your pedantic terminology. He's asking for us to come up with a better solution.

What you are looking for is a windows manager or theme, not an underlying OS

He most certainly is not. There's a lot more wrong with Linux than just the window manager, which is easily changed. Graphics and wireless drivers, for instance. The impossibility of maintaining a system without falling back on the command line for another. Dear god, the audio subsystems. And there are more.

I feel for the OP because I'm in the same boat. I don't want to use Windows because it's too bloated and uses an ancient filesystem. I don't want to use OS X because each release it gets a little less stable and the performance is erratic. I don't want to use linux because of the weeks I inevitably lose trying to get my NVidia card to work.

Unfortunately, I don't think yet another OS is going to help. The lack of graphics and wireless drivers will still plague it. Even if we start now, it'll be years before it reaches parity with the other major OS's, if it ever does. It'll need its own package scheme for applications (linux's is too complex and OS X's is too proprietary). Unfortunately, this means we'll have to convince app developers to support yet another OS target, which will be a major political undertaking.

The current solutions work well enough that it's hard to justify yet another OS.", "query": null, "by": "MrDom"}, {"ranking": 2, "story_id": "8503022", "time": "2014-10-24T19:59:30", "id": "8503201", "query_class": null, "text": "The problem with graphics and wireless drivers on Linux are that the manufacturers choose not to bother supporting their hardware on Linux. That's not really a problem with Linux.", "query": null, "by": "onion2k"}, {"ranking": 1, "story_id": "8503022", "time": "2014-10-24T20:04:58", "id": "8503217", "query_class": null, "text": "The driver problem perhaps could be disrupted. Suppose during installation you had the opportunity to pay the driver vendor directly for installing the driver- in other words, the disruption came because we let go of some of the "free" requirements, and came to do business directly with the sources of our tech.

This would be disruptive in that it would reduce the stranglehold the Microsoft is able to exert over the OEMs. Akin to selling cars directly to consumers, there would be an upside for the driver vendors that they may get behind.

So HNBuntu isn't "free"- it costs $15 to install on your system.

Perhaps the install has a fallback to the 'free' mode (for secondary devices, etc.)", "query": null, "by": "dhimes"}, {"ranking": 0, "story_id": "8503022", "time": "2014-10-24T20:31:55", "id": "8503301", "query_class": null, "text": "And I agree with you. The current OS market is stale.

The POSIX era is closing, it fails to properly model non-serial or disk based data operations. Flowing data like tcp/ip connections are horribly handled in the Unix like model. Linux is a bloated monster with thousands of system calls, and the BSD's are stable but user/developer hostile (MacOSX included at a systems level Darwin has a lot of memory management brain damage).

The problem largely with drivers is a war you can't win.

Windows has backwards compatibility written into it at a very fundamental level. This was a good lesson Windows learned from IBM early on. If you write something for windows 95, it'll likely work with windows8. System32 is still System32. Most your API's, IPC, Draw calls, etc. All still exist, most are actually faster.

The biggest selling point of an IBM mainframe isn't that they are fast. It isn't they have 400+ PPC chips, each with 24 virtual processors. Its that they are binary compatible with IBM System360. If you invested 10 man years writing an application in the 1970's, it still runs today, without the need to write or fix things. It just works. You can have faith in IBM and those guys with gold medallions and bellbottoms who are now balding managers.

Does it fully make economic sense? No. The cost of IBM equipment, support, etc. Is likely way more then 10 man years of software time over 40 year history that application has been deployed.

The fundamental problem is purchaser ignorance. The purchaser may see there are more competitive solutions. But the chain of command doesn't want to invest, it wants to be comfortable. You aren't fighting silicon valley investors so much as you are fighting wall street.

Compare this to say Uber. Which solved a fundamental problem. Hailing taxi's is stupid. Lets make it easier. Ask for a taxi on your app and wait. The quality of your life has improved. The balance sheet looks the same (largely) a taxi costs X dollars. But my throat isn't sore, my arm doesn't hurt, maybe this system is better.

In The Valley the issue would largely be the same.

Linux is king.

If you actually do invent a better solution the Linux. You'll need to convince google, facebook, twitter, amazon, etc. To redeploy all of their applications to your platform. And at best you could offer maybe a 5% performance increase. 5%, to redo billions in software? That won't delay a single upgrade in the data center. Data center costs stay the same, software development costs go up. How does that balance sheet look?

I'll give you a hint. Bad. There is no market, or demand for it. At best it'll end up being another marginalized fringe OS.

P.S.: If you want to do start with Plan9 work up from there, make the kernel interface work like 3.x linux kernal so you can use linux code. Might work.

P.P.S.: Disruption is based on a better product. OS's can never be a better product. OS's fundamentally trade off speed for usability or the opposite.", "query": null, "by": "valarauca1"}, {"ranking": 0, "story_id": "8503022", "time": "2014-10-24T21:02:52", "id": "8503427", "query_class": null, "text": "Darwin (OSX) is a BSD :^)

Also BSD's have roughly as many faults as Liunx, well not as many. But they commit the same POSIX sins that Linux does. I mean POSIX doesn't handle dynamic concurrent data well at all.

It wasn't built with TCP/IP in mind. Sockets are nice work around, but they don't actually fix the problem.", "query": null, "by": "valarauca1"}, {"ranking": 3, "story_id": "8503022", "time": "2014-10-24T21:32:50", "id": "8503537", "query_class": null, "text": "Well, in a way software doesn't seem to get a lot faster because now they're loaded with many more features in order to take advantage of the new pieces of hardware that have been appearing over the years, and I'm OK with that. I'd rather have a not-so-fast computer with useful features than a Flash-like machine that only works for the same things we used computers for in 1986.

However, I do agree on the fact that the experience must be changed, you can't help but feeling that everything you go through in today's computing (particularly desktop computing) seems dated. But then again, I'm not a technical guy either and posing a problem is a hell of a lot easier that fixing it, almost every time.

Oh, well. I guess I'll have to do with the fact that I can communicate with you at the speed of light. For now.", "query": null, "by": "jonifico"}, {"ranking": 0, "story_id": "8612819", "time": "2014-11-16T06:21:13", "id": "8612823", "query_class": null, "text": "what do you think about this website?", "query": null, "by": "apaphoto"}, {"ranking": 0, "story_id": "8663902", "time": "2014-11-27T03:19:02", "id": "8664092", "query_class": null, "text": "Prior discussion here:

https://news.ycombinator.com/item?id=8663303", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "8753434", "time": "2014-12-16T03:57:58", "id": "8754024", "query_class": null, "text": "If you think that's a bad investment, you should take a look at what my Blackberry shares have done over the past year.", "query": null, "by": "BrindsleyQuives"}, {"ranking": 1, "story_id": "8770323", "time": "2014-12-19T07:47:49", "id": "8770371", "query_class": null, "text": "Because they're super lazy?", "query": null, "by": "wmf"}, {"ranking": 0, "story_id": "8770323", "time": "2014-12-19T08:49:26", "id": "8770585", "query_class": null, "text": "I'm going to guess that they simply don't know that much about how to display and/or photograph a product, which is fairly common. The example you gave isn't nearly the worst situation: They at least gave it enough thought to give a basically neutral background and do something to display the product. Really all this person would have needed to do would be to hang a piece of cloth up and drape it underneath, but that is something easy to overlook.", "query": null, "by": "Broken_Hippo"}, {"ranking": 0, "story_id": "8778742", "time": "2014-12-21T13:22:19", "id": "8779024", "query_class": null, "text": "xe2x80x9cItxe2x80x99s horrific to have someone intentionally shoot a police officer; itxe2x80x99s the wrong message,xe2x80x9d he said. xe2x80x9cAnd that is not the message that many have been calling on when they talk about reform.xe2x80x9d

Well, what did people expect to happen? We've been sliding into a complete and utter disrespect for the concepts of justice and law in this country--eventually, this sort of thing was bound to happen.

The guy shot his girlfriend before doing in the cops, so he was probably just a crazy. That said, I would be unsurprised if this sort of thing happens more and more frequently. I really, really hope that I'm wrong.", "query": null, "by": "angersock"}, {"ranking": 0, "story_id": "8781788", "time": "2014-12-22T11:11:58", "id": "8781794", "query_class": null, "text": "Original CIA document, with extensive discussion:

https://news.ycombinator.com/item?id=8780689", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "8846541", "time": "2015-01-07T04:05:40", "id": "8846584", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "8894718", "time": "2015-01-16T03:43:31", "id": "8894872", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "8894282", "time": "2015-01-16T04:53:56", "id": "8895276", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 1, "story_id": "8896450", "time": "2015-01-16T09:03:04", "id": "8896623", "query_class": null, "text": "It seems that, when it comes to modern software offices, appearance is much more important than functionality. Makes me wonder how far that's true of their software as well ;-)", "query": null, "by": "scholia"}, {"ranking": 0, "story_id": "8896450", "time": "2015-01-16T09:17:01", "id": "8896689", "query_class": null, "text": "Previous discussion:\nhttps://news.ycombinator.com/item?id=8892587", "query": null, "by": "jcr"}, {"ranking": 0, "story_id": "8907317", "time": "2015-01-18T20:43:10", "id": "8907376", "query_class": null, "text": "These articles are pretty shy on actual costs as there could be many more cost items for both. Nevertheless great food for thought.", "query": null, "by": "manyabe"}, {"ranking": 0, "story_id": "8967937", "time": "2015-01-30T02:28:38", "id": "8967941", "query_class": null, "text": "http://atlantacode.com", "query": null, "by": "AtlantaCode"}, {"ranking": 0, "story_id": "9043288", "time": "2015-02-13T15:28:32", "id": "9043296", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "9060051", "time": "2015-02-17T09:14:23", "id": "9060097", "query_class": null, "text": "Even www.mummify.it is offline!", "query": null, "by": "nsmalch"}, {"ranking": 0, "story_id": "922510", "time": "2009-11-05T08:09:24", "id": "922944", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "9239460", "time": "2015-03-21T02:24:23", "id": "9239610", "query_class": null, "text": "A lot of things already use time windows like that. Package delivery, cable technician visits, garbage collection, ... .", "query": null, "by": "tbrownaw"}, {"ranking": 0, "story_id": "9251562", "time": "2015-03-24T00:12:48", "id": "9251635", "query_class": null, "text": "Is this like a knock knock joke?", "query": null, "by": "RuthSanchez"}, {"ranking": 0, "story_id": "9345276", "time": "2015-04-09T09:54:21", "id": "9345405", "query_class": null, "text": "Discussion from 2 days ago: https://news.ycombinator.com/item?id=9330734", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "9379272", "time": "2015-04-15T16:33:27", "id": "9379580", "query_class": null, "text": "https://news.ycombinator.com/item?id=8927151", "query": null, "by": "dang"}, {"ranking": 2, "story_id": "9433647", "time": "2015-04-24T23:01:18", "id": "9433781", "query_class": null, "text": "Thanks, I needed a laugh this morning!

I love the part about how long she has "studied" world history. Had me rolling! Absolutely priceless.

I could not finish because I was laughing too hard.", "query": null, "by": "LeoSolaris"}, {"ranking": 7, "story_id": "9433647", "time": "2015-04-24T23:03:49", "id": "9433798", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 5, "story_id": "9433647", "time": "2015-04-24T23:04:12", "id": "9433803", "query_class": null, "text": "I've heard of the insanity defense. Is this supposed to be the offensive variant?

EDIT: Not at all surprised to see this is from Florida.", "query": null, "by": "sarciszewski"}, {"ranking": 1, "story_id": "9433647", "time": "2015-04-24T23:07:32", "id": "9433824", "query_class": null, "text": "Man, scribd gets worse every time I look at it. Cannot wait for its successor.", "query": null, "by": "lawnchair_larry"}, {"ranking": 1, "story_id": "9433647", "time": "2015-04-24T23:12:08", "id": "9433852", "query_class": null, "text": "Can you explain this please? I'm from Europe.", "query": null, "by": "edem"}, {"ranking": 0, "story_id": "9433647", "time": "2015-04-24T23:12:57", "id": "9433858", "query_class": null, "text": "As some background - she claims that her arrest five years ago was a violation of her civil rights. Her 'crime'? Driving with fully-loaded assault rifles to her husband's prison, where they had planned to break him out.", "query": null, "by": "huac"}, {"ranking": 0, "story_id": "9433647", "time": "2015-04-24T23:13:34", "id": "9433869", "query_class": null, "text": "I'm from Florida, I'm not surprised either.... SADLY enough... Depends what parts of Florida you go to though.", "query": null, "by": "giancarlostoro"}, {"ranking": 2, "story_id": "9433647", "time": "2015-04-24T23:14:37", "id": "9433881", "query_class": null, "text": "The United States has a lot of culture based on different states and geographical locations, states could seem like entirely different countries to some degree, culturally speaking.", "query": null, "by": "giancarlostoro"}, {"ranking": 0, "story_id": "9433647", "time": "2015-04-24T23:15:36", "id": "9433889", "query_class": null, "text": "That whole paragraph is gold.

> Look here, old man, when I told you I AM Justice - I \nmeant it. It took me about 1 month to study the history of the world and to learn the history and inner workings of American jurisprudence, literally. I was born to do this here. Don't you know that your FBI and CIA have been trying to recruit me since grade school? Lol. But they're unscrupulous losers like you, so it won t be happening.

Navy seal copypasta, you've got competition!", "query": null, "by": "jjoonathan"}, {"ranking": 0, "story_id": "9433647", "time": "2015-04-24T23:16:17", "id": "9433894", "query_class": null, "text": "Sure. Florida is the epicenter of Western insanity.

http://www.fark.com/topic/florida

https://twitter.com/_FloridaMan

https://twitter.com/_Flor1daWoman

Having lived here most of my life, my hypothesis is that the heart of darkness lies somewhere near Fort Myers Beach.

If you must move to FL, don't move to Lee County if you can help it.", "query": null, "by": "sarciszewski"}, {"ranking": 3, "story_id": "9433647", "time": "2015-04-24T23:16:36", "id": "9433896", "query_class": null, "text": "Sort of a movement where people reject the federal government which always boils down to them not wanting to pay taxes.", "query": null, "by": "bfuller"}, {"ranking": 1, "story_id": "9433647", "time": "2015-04-24T23:17:00", "id": "9433898", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 3, "story_id": "9433647", "time": "2015-04-24T23:18:00", "id": "9433906", "query_class": null, "text": "I have to say. Her writing is forceful, her passion palpable, and her grammar appears sound, in a Latinate legalistic sort of way.

Her diction, though, is for the ages.", "query": null, "by": "klenwell"}, {"ranking": 0, "story_id": "9433647", "time": "2015-04-24T23:18:34", "id": "9433912", "query_class": null, "text": "As a New Jersey resident I feel weird whenever I'm in New York and Pennsylvania, despite both being about an hour drive from where I live.", "query": null, "by": "joshuapants"}, {"ranking": 6, "story_id": "9433647", "time": "2015-04-24T23:18:47", "id": "9433914", "query_class": null, "text": "> "United States of America have been overthrown."", "query": null, "by": "justaman"}, {"ranking": 1, "story_id": "9433647", "time": "2015-04-24T23:19:08", "id": "9433917", "query_class": null, "text": "It doesn't appear to even work on Windows Phone - it can't go to the next page or zoom in.", "query": null, "by": "stordoff"}, {"ranking": 4, "story_id": "9433647", "time": "2015-04-24T23:19:11", "id": "9433918", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "9433647", "time": "2015-04-24T23:19:31", "id": "9433926", "query_class": null, "text": "I was thinking the exact same thing, it's almost unusable.", "query": null, "by": "stevepm"}, {"ranking": 0, "story_id": "9493139", "time": "2015-05-06T00:16:52", "id": "9493306", "query_class": null, "text": "how is this relevant?", "query": null, "by": "celticninja"}, {"ranking": 0, "story_id": "9504043", "time": "2015-05-07T18:19:10", "id": "9504062", "query_class": null, "text": "Can't unsee!", "query": null, "by": "psykovsky"}, {"ranking": 0, "story_id": "9524925", "time": "2015-05-11T22:25:18", "id": "9524947", "query_class": null, "text": "We've just launched a redesign and rebranding of our website and we'd would love to hear some feedback from HN!

The Larrytech Team", "query": null, "by": "larrytech"}, {"ranking": 0, "story_id": "9552674", "time": "2015-05-16T03:11:04", "id": "9552946", "query_class": null, "text": "That's the biggest pile of crap this side of a buffalo herd.

The CERN beam dump has less power than a lightning bolt.

CERN beam dump = about 350MJ (see http://proj-lbds.web.cern.ch/proj-lbds/ )

one good sized lightning bolt is about 1GJ (see http://van.physics.illinois.edu/qa/listing.php?id=2280 or http://en.wikipedia.org/wiki/Harvesting_lightning_energy )

A thunderstorm, which can produce gamma ray and antimatter, requires some 1 PETAjoules. See http://en.wikipedia.org/wiki/Thunderstorm#Energy . The 2013 Chelyabinsk meteor in Siberia was also in the petajoule range.

Saying CERN triggered the earthquake via a beam dump is like saying I caused the earthquake because I took a dump that day.", "query": null, "by": "dalke"}, {"ranking": 0, "story_id": "9552674", "time": "2015-05-16T04:20:13", "id": "9553404", "query_class": null, "text": "If you remove the first sentence, I would upvote this comment. [Not because the first sentence is wrong, but it does not contribute to a civilized discussion.]", "query": null, "by": "gus_massa"}, {"ranking": 0, "story_id": "9575303", "time": "2015-05-20T17:46:38", "id": "9575304", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "9630715", "time": "2015-05-31T00:54:36", "id": "9630751", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "9695471", "time": "2015-06-11T06:43:27", "id": "9696145", "query_class": null, "text": "This is a dupe of https://news.ycombinator.com/item?id=9692635", "query": null, "by": "bdcravens"}, {"ranking": 0, "story_id": "9729079", "time": "2015-06-17T06:43:43", "id": "9729159", "query_class": null, "text": "Extensive discussion: https://news.ycombinator.com/item?id=9721212 (plus at least a dozen other related postings already).", "query": null, "by": "greenyoda"}, {"ranking": 0, "story_id": "9775429", "time": "2015-06-25T09:19:33", "id": "9775461", "query_class": null, "text": "And you are peanut butter.

Making false statements with conviction doesn't mean they become correct.

If Boober were a lead generation company, it would charge a flat fee for leads and the people who accepted the leads would be free to conduct their business as they wish.

Boober is a transportation company that hires drivers-- but would like to pretend otherwise to duck costs and legal responsibilities.", "query": null, "by": "rufusjones"}, {"ranking": 4, "story_id": "9786010", "time": "2015-06-27T01:23:18", "id": "9786285", "query_class": null, "text": "skrill braintree and stripe are good.

maybe a indonesian processor, like doku?

best to get a real job for day and sell software as a side job. maybe something where you can get tips from tourists like taxi driver, tourguide, bar tender, resturant server (not sure if they tip there), or something like that.", "query": null, "by": "mc_hammer"}, {"ranking": 1, "story_id": "9786010", "time": "2015-06-27T01:42:16", "id": "9786431", "query_class": null, "text": "It is going to be difficult for someone in another country to navigate Indonesia's infrastructure better than a local. It would probably be helpful if you described the possible options from your end.

Good luck.", "query": null, "by": "brudgers"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-27T01:44:29", "id": "9786448", "query_class": null, "text": "sorry but, doku has no faq about how to withdraw from international payment

EDIT:it doesn't support digital goods", "query": null, "by": "cognitvesystem"}, {"ranking": 7, "story_id": "9786010", "time": "2015-06-27T01:51:32", "id": "9786494", "query_class": null, "text": "> I was born christian in country where Muslim is majority, some of 'em are racist.

Religion is a choice, not a race. Nobody is "born Christian". You're born naked and crying with no such concept.

Religious intolerance can sometimes be aligned with racial intolerance, but it isn't racism.", "query": null, "by": "kazinator"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-27T02:20:51", "id": "9786685", "query_class": null, "text": "yes you are right, in other word is they are biased.

for example when I want to rent a room \nI'v seen the sign goes "just Muslim".", "query": null, "by": "cognitvesystem"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-27T02:50:20", "id": "9786891", "query_class": null, "text": "Is there any platform (like gumroad) support Indonesia", "query": null, "by": "cognitvesystem"}, {"ranking": 5, "story_id": "9786010", "time": "2015-06-27T03:22:45", "id": "9787124", "query_class": null, "text": "Your best chance is probably to get on a boat and immigrate illegally to Australia.

Good luck.", "query": null, "by": "pliny"}, {"ranking": 1, "story_id": "9786010", "time": "2015-06-27T04:26:31", "id": "9787514", "query_class": null, "text": "How to sell native software online beside gumroad that can payout with bank account", "query": null, "by": "amberjs"}, {"ranking": 6, "story_id": "9786010", "time": "2015-06-27T04:32:45", "id": "9787555", "query_class": null, "text": "Where in Indonesia?

Skills that you can offer?", "query": null, "by": "pvaldes"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-27T04:46:08", "id": "9787643", "query_class": null, "text": "If someone can send you money, I am wondering if Western Union or MoneyGram might be viable options?

Beyond that, you need to start working on long term solutions. I don't know what that would be in your case. Maybe you were asking for a viable solution to run an online business? I am not 100% clear here.

I wish I could send you money. I can't. I am homeless myself, though homeless in America. I struggle to get enough to eat every month. So I don't have money to spare.

I am sorry for some of the replies you have gotten here. There is no shortage of callous jerks in the world who just don't appreciate how good they have it.

Good luck.", "query": null, "by": "Mz"}, {"ranking": 0, "story_id": "9789233", "time": "2015-06-27T14:08:43", "id": "9789282", "query_class": null, "text": "This is the second highest link on the front page right now!

https://news.ycombinator.com/item?id=9787519", "query": null, "by": "detaro"}, {"ranking": 3, "story_id": "9786010", "time": "2015-06-27T21:11:25", "id": "9790029", "query_class": null, "text": "How about setting up a company in a country where you can?

You could set up a UK company, for example, and accept payments through Stripe and Paypal in name of the company. The company can then pay you a salary/dividends/etc.", "query": null, "by": "charlesdm"}, {"ranking": 2, "story_id": "9786010", "time": "2015-06-27T22:17:52", "id": "9790226", "query_class": null, "text": "There are tons of payment gateways. Doku.com being the biggest. This guy is a troll.", "query": null, "by": "philtar"}, {"ranking": 1, "story_id": "9786010", "time": "2015-06-27T22:43:44", "id": "9790303", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-27T23:17:51", "id": "9790399", "query_class": null, "text": "sorry, Doku is for physical goods, you know Indonesia has relatively low in software industry sector. Please don't judge me check the site first

and again I need a gumroad.com-like where payout is through bank account and support my country(Indonesia).'

There is no such platform like that in my country :(

I spend for few years to research about this.", "query": null, "by": "indoindo"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-28T00:01:23", "id": "9790547", "query_class": null, "text": "http://www.quora.com/What-are-the-leading-payment-gateway-co...

maybe that can help

try adding +digital to a search like "indonesia payment processor"", "query": null, "by": "mc_hammer"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-28T00:21:40", "id": "9790617", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 1, "story_id": "9786010", "time": "2015-06-28T00:43:15", "id": "9790680", "query_class": null, "text": "how homeless set up a company

you mean immigrate to UK?", "query": null, "by": "indoindo"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-28T01:28:33", "id": "9790837", "query_class": null, "text": "Well, you should focus on getting on your feet first (i.e. get a development job), making sure you can survive and make a decent living.

But you can open a UK company and run it from Indonesia.", "query": null, "by": "charlesdm"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-28T01:55:54", "id": "9790942", "query_class": null, "text": "I must waiting for 100 years till I die (now 21 years old) to have one employee to handle online payment system. Genius!", "query": null, "by": "indoindo"}, {"ranking": 2, "story_id": "9786010", "time": "2015-06-28T04:45:27", "id": "9791483", "query_class": null, "text": "agree, I had some doubts but is crystal clear now...", "query": null, "by": "pvaldes"}, {"ranking": 0, "story_id": "9786010", "time": "2015-06-28T14:40:06", "id": "9792665", "query_class": null, "text": "", "query": null, "by": ""}, {"ranking": 1, "story_id": "9794132", "time": "2015-06-29T00:58:04", "id": "9794153", "query_class": null, "text": "OK cool!

...", "query": null, "by": "slater"}, {"ranking": 0, "story_id": "9794132", "time": "2015-06-29T01:06:29", "id": "9794178", "query_class": null, "text": "Can anyone track that last comment?", "query": null, "by": "skyz2hot"}, {"ranking": 0, "story_id": "9883582", "time": "2015-07-14T17:32:40", "id": "9883699", "query_class": null, "text": "And no Linux support. I wonder why. Is it because everyone is happy with CLI?", "query": null, "by": "hohenheim"}, {"ranking": 1, "story_id": "9883582", "time": "2015-07-14T17:37:37", "id": "9883713", "query_class": null, "text": "What's the chances that this is built on Electron?", "query": null, "by": "podgib"}, {"ranking": 0, "story_id": "9883582", "time": "2015-07-14T17:43:18", "id": "9883736", "query_class": null, "text": "None. (At least the Mac version is not built on Electron.)", "query": null, "by": "dchest"}, {"ranking": 0, "story_id": "9883582", "time": "2015-07-14T17:43:33", "id": "9883739", "query_class": null, "text": "If it's built on Electron, there's no reason not to support Linux. Perhaps they plan to add it later.

Either that or they just don't think Linux deserves a GitHub GUI client.", "query": null, "by": "HatersGunnaHate"}, {"ranking": 0, "story_id": "9883582", "time": "2015-07-14T17:44:39", "id": "9883744", "query_class": null, "text": "It's not based on Electron, looks like just a continuation of the code base they had, so no easy Linux version.", "query": null, "by": "dchest"}, {"ranking": 0, "story_id": "9883582", "time": "2015-07-14T18:26:18", "id": "9883870", "query_class": null, "text": "Fair enough. I've only seen the splash page. Surprises me somewhat given that they now have a solid cross-platform shell for 'native' web-based apps.", "query": null, "by": "podgib"}, {"ranking": 2, "story_id": "9883582", "time": "2015-07-14T18:42:00", "id": "9883913", "query_class": null, "text": "Not even a screenshot?!", "query": null, "by": "GordonS"}, {"ranking": 0, "story_id": "9898306", "time": "2015-07-17T01:07:41", "id": "9898453", "query_class": null, "text": "Eid Mubarak xd8xb9xd9x8axd8xaf xd9x85xd8xa8xd8xa7xd8xb1xd9x83", "query": null, "by": "husamia"}, {"ranking": 7, "story_id": "9953231", "time": "2015-07-27T12:37:33", "id": "9953369", "query_class": null, "text": "lol", "query": null, "by": "paradox242"}, {"ranking": 1, "story_id": "9953231", "time": "2015-07-27T12:42:28", "id": "9953381", "query_class": null, "text": "sigh another angry gamer with no patience for theory. If you believe Sarkeesian (or anyone else for that matter) does indeed have an invalid argument, you've got to provide evidence to that effect, not just ad hominem blather. Mildly interesting point about these efforts possibly not doing much to get women into the industry today but overall this is whimpering not worthy of HN.", "query": null, "by": "tammer"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T12:45:01", "id": "9953389", "query_class": null, "text": "> There have been countless detailed refutations that dismantle pretty much every argument Anita Sarkeesian has put forth

Does anyone have a link to such a refutation? I've always found Anita's videos to be strikingly articulate, well-cited, and seemingly watertight in their reasoning.

If there's an equally intellectually rigorous rebuttal, I'm interested to watch it. But so far, the rebuttals I've seen have been lazy in their logic, or went after strawmen, or were splitting hairs over a one-time poor choice of words (the example embedded in the link above).", "query": null, "by": "raldi"}, {"ranking": 3, "story_id": "9953231", "time": "2015-07-27T12:45:42", "id": "9953390", "query_class": null, "text": "The fact that posts like these get upvotes makes me want to delete my hn account/bookmark", "query": null, "by": "zajd"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T12:48:14", "id": "9953394", "query_class": null, "text": "> sigh another angry gamer with no patience for theory.

What meaning of the word theory do you use here?", "query": null, "by": "eru"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T12:55:36", "id": "9953416", "query_class": null, "text": "This is the broad academic use of the word. Specifically Sarkeesian builds upon feminist film theory.", "query": null, "by": "tammer"}, {"ranking": 2, "story_id": "9953231", "time": "2015-07-27T12:59:21", "id": "9953422", "query_class": null, "text": "So... the point of this article is?

I see the long winding whinging about how a white cis male is being persecuted and is trying to gain sympathy, or something. OK, so you had threatening comments supposedly aimed at you at one point. You hid from it, you didn't challenge it - and you are complaining that women, who get that shit EVERY DAY, are challenging it. This is one of your arguments? You are seriously trying to convince me that these women who have literally risked their life to speak out against the violence and persecution they face are some how doing something wrong? Good god man...

The ONLY point of value in this entire rant that I can see is the comment about the damage to the industry reputation for recruiting women. Is this valid? Is there evidence? I don't care who this guy is or if he stays anonymous (manufactured drama...), data backs arguments up. Until there is data, this is a pointless, emotional dump based on nothing but hatred and hurt.", "query": null, "by": "blindhippo"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T13:00:29", "id": "9953425", "query_class": null, "text": "OK, you meant the bullshit use of the word, I didn't miss out on anything. Bullshit is a technical term here.

As opposed to the notion of a theory used as something to predict phenomena. Especially prediction we can check, and falsify.", "query": null, "by": "eru"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T13:06:27", "id": "9953439", "query_class": null, "text": "HN should have killed this post immediately, right? It's a serious threat to many people's mental well being!

What a misogynistic website. There's, like, 15 people among the thousands that view this website which up-voted this article. HN should probably just remove itself from the internet now. People might see these opinions!

it unfortunately may be necessary to confirm this is sarcasm

EDIT: well it's killed now, no more comments, can't even click the original link... will I risk the heresy of linking to the un-allowable text here? why not: https://stateofthegaming.wordpress.com/2015/07/26/the-oppres...", "query": null, "by": "ploxiln"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T13:07:47", "id": "9953442", "query_class": null, "text": "Invariably such refutations fixate on the specific examples chosen by Sarkeesian and go on to make flawed arguments like e.g. (paraphrasing):

> Violence against women in XYZ is not problem because XYZ also features violence against men!

Which is completely besides the point and ignores the societal context into which these games are released. Other common "critiques" leveled against Sarkeesian, that I've seen anyway, are straight up strawmen. These include gems like she's in favour of censorship or that she argues games have the ability to directly manipulate people into violence or sexism.

Innuendo Studios recently posted a great analysis of this phenomenon in their "Why Are You So Angry?" video series. It's really well done and worth checking out:\nhttps://www.youtube.com/watch?v=6y8XgGhXkTQ&list=PLJA_jUddXv...

The OP reads just like an Angry Jack.", "query": null, "by": "gradstudent"}, {"ranking": 4, "story_id": "9953231", "time": "2015-07-27T13:12:04", "id": "9953454", "query_class": null, "text": "The author sets up so many strawman arguments, I wonder whether he has bothered to engage with the Sarkeesian et al. in the way he's imploring journalists to engage with GamerGaters.

For example, that journalists/society make all women out to be paragons of virtue:

> Ixe2x80x99ve seen how women can treat each other, and can put my hand on my heart and say Ixe2x80x99ve generally seen IRL women being much nastier to other women than Ixe2x80x99ve EVER seen a man being to a woman. Letxe2x80x99s not paint women as some saintly figures incapable of doing any wrong. This is the root of all our problems here.

Or when he accuses some of those same figures of wanting to keep vile comments coming:

> ...another example was a photo of them laughing at dumb trolls tweets on their phones in a bar, not an opportunity was spared to say xe2x80x98fuck youxe2x80x99 and rattle the bear cage to keep the abuse train running. This is not what someone who wants the abuse to stop does.", "query": null, "by": "muglug"}, {"ranking": 0, "story_id": "9953231", "time": "2015-07-27T13:18:54", "id": "9953477", "query_class": null, "text": "Silly strawmen and hyperbole aside, the fact that trash articles like this make it to (or near) the top of HN, however briefly, is certainly to it's detriment.", "query": null, "by": "Steko"}, {"ranking": 6, "story_id": "9953231", "time": "2015-07-27T13:19:51", "id": "9953479", "query_class": null, "text": "I once dated Gabe Newell's sister.

He thinks Tani is a total slacker because psychotherapists dont make much money.

Tani thinks Gabe is a total slacker because he writes video games.", "query": null, "by": "MichaelCrawford"}, {"ranking": 5, "story_id": "9953231", "time": "2015-07-27T13:41:45", "id": "9953540", "query_class": null, "text": "I've realized that as a white male who has generally kept both my sexual orientation and religion (or lack of religion) on a need to know basis, I have a big advantage over non-males, non-whites, non-heterosexuals, and non-Christians (and Christians on many parts of the net).

When someone expresses hate or threatens me, I know it is because either I've been a colossal asshat or they are mentally disturbed.

People who fall into those other categories have to consider the additional possibility that it is because of their membership in one of those categories.

Unfortunately, many people make the mistake of assuming that all negativity directed toward them comes from that, and completely overlook that some or even most of it may be due to them being colossal asshats.

Then others in their category jump to their defense, without taking into account whether or not the negativity was due to category membership or not. Trolls see this and jump in making category based attacks. Those who are criticizing the original person for their behavior, not their category, and are not doing so in rude or aggressive ways then get pissed off because they get lumped with the trolls. And then it all goes to hell.

Not sure what, if anything, can be done about this.", "query": null, "by": "tzs"}, {"ranking": 0, "story_id": "9958092", "time": "2015-07-28T05:54:41", "id": "9958274", "query_class": null, "text": "Please stop spamming this site every few days.

https://news.ycombinator.com/item?id=9947181

https://news.ycombinator.com/item?id=9942116", "query": null, "by": "kseistrup"}, {"ranking": 1, "story_id": "9983158", "time": "2015-08-01T02:36:54", "id": "9983468", "query_class": null, "text": "Are you offering a rockstar salary? I understand true rockstars earn at least seven figures.", "query": null, "by": "chmaynard"}, {"ranking": 0, "story_id": "9983158", "time": "2015-08-01T11:55:48", "id": "9985863", "query_class": null, "text": "https://news.ycombinator.com/newsfaq.html

Can I post a job ad?

A regular "Who Is Hiring?" thread appears at the beginning of every month, and you're welcome to post there. The rest of the time, job posts are reserved for Y Combinator-funded startups.

An account named whoishiring is the only one allowed to submit the regular threads. This prevents a race to post them first.

A single YC startup job post may appear on the front page at a time. Job posts have no vote arrow and just a timestamp in place of the usual story details. They begin partway down the front page and fall steadily in rank.", "query": null, "by": "jcr"}]